package www.qige.com.word;


import org.apache.commons.lang3.StringUtils;
import org.apache.poi.ss.usermodel.PictureData;
import www.qige.com.entity.ReportEntity;

import javax.swing.*;
import java.awt.*;
import java.awt.event.ActionEvent;
import java.awt.event.ActionListener;
import java.io.File;
import java.text.DecimalFormat;
import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.Map;

public class CreateReportAction extends JFrame implements ActionListener{
    JButton jbPerson = new JButton("导入个人信息");
    JButton jbResult = new JButton("导入检测结果");
    JButton jbReport = new JButton("生成报告");
    JTextArea   textarea   = new JTextArea ("\n"
            +"使用说明\n" +
            "\n"+
            "注意事项：请勿删除任何文件夹！！！\n" +
            "\n"+
            "1.点击start.bat启动程序，启动可能需要1-5s时间，请耐心等待\n" +
            "\n"+
            "2.点击导入个人信息按钮，导入文件，弹出导入个人信息成功后进入下一步\n" +
            "\n"+
            "3.点击导入检测结果，导入文件，弹出导入检测成功后进入下一步\n" +
            "\n"+
            "4.点击生成报告，弹出生成报告成功后，在report文件夹下生成报告\n");
    private Map<Integer, Map<Integer,Object>> personInfo;
    private Map<Integer, Map<Integer,Object>> resultInfo;
    private java.util.List<String> resultTime = new ArrayList<>();
    private Map<String, Map<Integer,Object>> resultMap = new HashMap<>();
    java.util.List<ReportEntity> reportList = new ArrayList<ReportEntity>();

    public CreateReportAction(){
        jbPerson.setActionCommand("openPerson");
        jbResult.setActionCommand("openResult");
        jbReport.setActionCommand("createReport");
        jbPerson.setBackground(Color.CYAN);//设置按钮颜色
        jbResult.setBackground(Color.CYAN);//设置按钮颜色
        jbReport.setBackground(Color.CYAN);//设置按钮颜色
        jbPerson.setSize(20,20);
        jbResult.setSize(20,20);
        jbReport.setSize(20,20);
        //初始化一个文字区域

        textarea.setFont(new Font("黑体",Font.BOLD,16));
        textarea.setEditable(false);
        Container container = this.getContentPane();
        container.setLayout(new FlowLayout());
        container.add(jbPerson);//建立容器使用边界布局
        container.add(jbResult);//建立容器使用边界布局
        container.add(jbReport);//建立容器使用边界布局
        container.add(textarea);
        //
        jbPerson.addActionListener(this);
        jbResult.addActionListener(this);
        jbReport.addActionListener(this);
        this.setTitle("检测报告生成工具");
        this.setSize(600, 400);
        this.setLocation(200,200);
        //显示窗口true  
        this.setVisible(true);
        this.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
    }
    public void actionPerformed(ActionEvent e){
        if (e.getActionCommand().equals("openPerson")){
            JFileChooser jf = new JFileChooser();
            jf.showOpenDialog(this);//显示打开的文件对话框  
            File f =  jf.getSelectedFile();//使用文件类获取选择器选择的文件  
            String path = f.getAbsolutePath();//返回路径名
            ReadPersonExcelUtils readExcelUtils = new ReadPersonExcelUtils(path);
           try {
               personInfo = readExcelUtils.readExcelContent();
               JOptionPane.showMessageDialog(this, "成功导入个人信息", "标题",JOptionPane.WARNING_MESSAGE);
            } catch (Exception e1) {
                JOptionPane.showMessageDialog(this, "导入个人信息错误", "标题",JOptionPane.WARNING_MESSAGE);
                e1.printStackTrace();
            }
        }else if (e.getActionCommand().equals("openResult")){
            JFileChooser jf = new JFileChooser();
            jf.showOpenDialog(this);//显示打开的文件对话框
            File f =  jf.getSelectedFile();//使用文件类获取选择器选择的文件
            String path = f.getAbsolutePath();//返回路径名
            ReadExcelUtils readExcelUtils = new ReadExcelUtils(path);
            try {
                //男性P53 rs1042522 APOE rs429358 女性 P53 rs1042522 MTHFR rs1801133
                resultInfo = readExcelUtils.readExcelContent();
                for(Map.Entry<Integer, Map<Integer, Object>> entry : resultInfo.entrySet()){
                    if(StringUtils.isNotEmpty((String)entry.getValue().get(1))){
                        String num = (String)entry.getValue().get(1);
                        if(num.contains(".0")){
                            num = num.replace(".0","");
                        }
                        String geneNum = (String)entry.getValue().get(3);
                        resultTime.add(num);
                        resultMap.put(num+geneNum,entry.getValue());
                    }
                }
                JOptionPane.showMessageDialog(this, "成功导入检测结果", "标题",JOptionPane.WARNING_MESSAGE);
            } catch (Exception e1) {
                JOptionPane.showMessageDialog(this, "导入检测结果错误", "标题",JOptionPane.WARNING_MESSAGE);
                e1.printStackTrace();
            }
        }else if (e.getActionCommand().equals("createReport")){
            try {

                for(Map.Entry<Integer, Map<Integer, Object>> entry : personInfo.entrySet()){
                    if(StringUtils.isNotEmpty((String)entry.getValue().get(1))){
                        ReportEntity entity = new ReportEntity();
                        String num = (String) entry.getValue().get(1);
                        if(num.contains(".0")){
                            num = num.replace(".0","");
                        }
                        if(2 == Collections.frequency(resultTime,num)){
                            entity.setName((String) entry.getValue().get(2));
                            entity.setFileName((String) entry.getValue().get(0));
                            entity.setNum(num);
                            String sex = (String) entry.getValue().get(3);
                            entity.setSex(sex);
                            StringBuffer sbSicks = new StringBuffer();
                            for(int i = 4;i<=33;i++){
                                if(StringUtils.isNoneEmpty((String)entry.getValue().get(i))){
                                    sbSicks.append((String)entry.getValue().get(i));
                                }
                            }
                            String thesicks = sbSicks.toString();
                            if(thesicks.endsWith("、")){
                                thesicks = thesicks.substring(0,thesicks.length()-1);
                            }
                            entity.setSicks(thesicks);
                            StringBuffer setFamilySicks = new StringBuffer();
                            for(int j = 34;j<=53;j++){
                                if(StringUtils.isNoneEmpty((String)entry.getValue().get(j))){
                                    setFamilySicks.append((String)entry.getValue().get(j));
                                }
                            }
                            String familySicks = setFamilySicks.toString();
                            if(thesicks.endsWith("、")){
                                familySicks = familySicks.substring(0,thesicks.length()-1);
                            }
                            entity.setFamilySicks(familySicks);
                            String p53Res = "";
                            String p53Type = "";
                            String apoeRes = "";
                            String apoeType = "";
                            try {
                                p53Res = (String) resultMap.get(num + "rs1042522").get(5);
                                entity.setP53Res(p53Res);
                                p53Type = getP53Type(p53Res);
                                if(p53Type.isEmpty()) continue;//跳出循环
                                entity.setP53Type(p53Type);
                                entity.setP53Pic1((PictureData)resultMap.get(num + "rs1042522").get(7));
                                PictureData apoePic1;
                                if("男".equals(sex)){
                                    apoeRes = (String) resultMap.get(num + "rs429358").get(5);
                                    apoeType = getApoeType(apoeRes);
                                    apoePic1 = (PictureData) resultMap.get(num + "rs429358").get(7);
                                }else{
                                    apoeRes = (String) resultMap.get(num + "rs1801133").get(5);
                                    apoeType = getMTHFRType(apoeRes);
                                    apoePic1 = (PictureData) resultMap.get(num + "rs1801133").get(7);
                                }
                                entity.setApoeRes(apoeRes);
                                if(apoeType.isEmpty()) continue;
                                entity.setApoeType(apoeType);
                                entity.setAopePic1(apoePic1);
                            } catch (Exception e1) {
                                System.out.println(num+"数据不匹配，跳过生成报告");
                                continue;
                            }
                            //病及风险
                            if("男".equals(sex)){
                                setRiskAndLevel(p53Type,apoeType,entity);
                            }else {
                                setRiskAndLevelWomen(p53Type,apoeType,entity);
                            }
                            //结果分析
                            String sicks = entity.getSicks();
                            if("男".equals(sex)){
                                StringBuffer sb = new StringBuffer();
                                if(entity.getSicks().contains("直肠炎")||entity.getSicks().contains("便秘")||entity.getSicks().contains("肠病")) {
                                    sb.append("研究显示桔橘橙类水果、葱蒜类是结肠癌的保护因素，香蕉是结肠癌的危险因素；白菜类是直肠癌的保护因素，芋薯类是直肠癌的危险因素；膳食营养素中的钙是结直肠癌最重要的保护因素；既往肠息肉、血吸虫病史是结直肠癌的危险因素。建议您去医疗机构详细检查，并积极治疗，同时在饮食结构上多食用桔橘橙类水果、葱蒜类、白菜类食物，减少香蕉、芋薯类食物摄入。\n");
                                }
                                if(entity.getSicks().contains("胃病")){
                                    sb.append("大量研究结果显示饮水来源、吸烟、经常吃腌制食品、有胃溃疡疾病史、近亲有胃癌疾病史及上消化道症状反复时间为胃癌发病的独立危险因素，提示暴露于以上环境因素、饮食习惯及遗传因素可能增加胃黏膜与致癌物质的接触机会，从而并削弱黏膜慢性炎症损伤修复的能力，继而导致慢性胃炎发展为胃癌。建议您去医疗机构检查，并积极治疗，同时在环境因素及饮食习惯上需多注意，杜绝不良因素诱导，健康生活！\n");
                                }
                                if(entity.getSicks().contains("肝硬化")
                                        ||entity.getSicks().contains("肥胖")
                                        ||entity.getSicks().contains("糖尿病")
                                        ||entity.getSicks().contains("非酒精性脂肪肝")
                                        ||entity.getSicks().contains("脂肪肝")
                                        ||entity.getSicks().contains("肝病")){
                                    sb.append("大量证据表明，肝癌的发生是一个多阶段、多因素共同累积的结果，其发生过程是由体外致癌因素联合自身免疫缺陷、基因水平等一系列因素导致的。肝癌病因复杂，包括不可控因素及可控制因素，不可控因素包括性别、年龄、血型、宿主遗传、基因类型及基因突变等。饮酒与吸烟是肝癌发生的危险因素之一，另外还有健康状况方面代谢综合征如肝硬化、肥胖、糖尿病、非酒精性脂肪肝以及社会心理及精神因素肝癌发生的危险因素之一。\n    ");
                                }
                                if(entity.getSicks().contains("肺炎")||entity.getSicks().contains("支气管炎")){
                                    sb.append("研究证实，气管炎是并发肺癌的主要原因，减少气管炎患者的人数将大大减少肺癌的发病率。气管感染的患者促使肺脏内的炎症因子的释放，浸润并作用于肺内的细胞，分泌IL-1、IL-6等细胞因子及肿瘤的坏死因子及其他相关因子。这些因子将作用于肺脏细胞，引起细胞的反应，最后导致肺癌发生。鉴于您有炎症，您首先积极治疗炎症，减轻肺脏的负担，同时一定不要抽烟，并远离二手烟接触，为您的健康保驾护航！\n    ");
                                }
                                if(entity.getSicks().contains("吸烟")){
                                    sb.append("您有长时间吸烟史，香烟中的尼古丁、亚硝胺等物质可导致基因甲基化而诱导癌症的发生。主动吸烟和被动吸烟分别作为肺癌、肝癌患病的危险因素已经被世界范围内大量的流行病学调查所证实，且被动吸烟者宫颈黏液中烟草相关致癌物质含量高于主动吸烟者。建议您远离吸烟场所，减少接触癌症诱发的因素。\n    ");
                                }
                                if(entity.getSicks().contains("饮酒")){
                                    sb.append("酒精被认为是可能诱发肝癌的危险因素。大量饮酒可促进肝癌发生。大数据分析结果表明，饮酒25 g·d-1及以上是肝癌的危险因素，并有随着每日饮酒量的增加，肝癌发病率增加的趋势。主要原因为：一方面，酒精可增加乳腺上皮细胞膜的通透性，通过乙醇诱导酶而增加致病因子的代谢，抑制DNA的损伤修复。您有饮酒习惯。建议您远离酒精，健康生活。\n    ");
                                }

                                sb.insert(0,"\n    ");
                                if(sb.toString().endsWith("\n    ")) {
                                    sb.delete(sb.length() - 5, sb.length());
                                }
                                entity.setResOnes(sb.toString());
                                StringBuffer sbtwo = new StringBuffer();
                                if(entity.getSicks().contains("高血压")){
                                    sbtwo.append("研究表明高血压是诱发各种心脑血管疾病，尤其是脑卒中疾病的元凶。研究表明，血浆Hcy 水平在脑卒中患者中明显升高。根据中国心血管病人群监测( WHOMONICA 方案) 最新发表数据，我国脑卒中仍以每年8. 7%的速率增长，脑卒中发病率远远高于其他国家，居亚太地区第一名，较美国高出1 倍，男女性脑卒中发病率均高达27%，在脑卒中的多种可控因素中，高血压和HHcy 排在前两位，二者具有显著协同作用。研究表明，单独存在高血压或高同型半胱氨酸血症的患者，脑卒中死亡的风险分别为正常人群的3 倍和4 倍，当高血压同时合并Hcy 升高时，脑卒中发生风险增加明显。鉴于您血压偏高，建议您一定积极治疗，控制血压，预防并发症的发生。\n    ");
                                }
                                if(entity.getSicks().contains("冠心病")||
                                        entity.getSicks().contains("脑供血不足")||entity.getSicks().contains("动脉硬化")
                                        ||entity.getSicks().contains("心脏病")){
                                    sbtwo.append("您有心脑血管或相关疾病，建议您适当增加锻炼，健康饮食，舒心生活！\n    ");
                                }
                                if(entity.getSicks().contains("糖尿病")){
                                    sbtwo.append("大量研究表明，糖尿病并发症有：糖尿病肾病、糖尿病眼病、糖尿病足病、糖尿病心血管病、糖尿病脑血管病等，鉴于您患有糖尿病，建议您密切关注以上疾病，同时积极治疗、控制血糖。\n    ");
                                }
                                sbtwo.insert(0,"\n    ");
                                if(sbtwo.toString().endsWith("\n    ")) {
                                    sbtwo.delete(sbtwo.length() - 5, sbtwo.length());
                                }
                                entity.setResTwos(sbtwo.toString());
                            }else {  //女性健康分析
                                StringBuffer sb1 = new StringBuffer();
                                if(sicks.contains("直肠炎")||sicks.contains("便秘")||sicks.contains("肠病")){
                                    sb1.append("研究显示桔橘橙类水果、葱蒜类是结肠癌的保护因素，香蕉是结肠癌的危险因素；白菜类是直肠癌的保护因素，芋薯类是直肠癌的危险因素；膳食营养素中的钙是结直肠癌最重要的保护因素；既往肠息肉、血吸虫病史是结直肠癌的危险因素。建议您去医疗机构详细检查，并积极治疗，同时在饮食结构上多食用桔橘橙类水果、葱蒜类、白菜类食物，减少香蕉、芋薯类食物摄入。\n    ");
                                }
                                if(sicks.contains("胃病")){
                                    sb1.append("大量研究结果显示饮水来源、吸烟、经常吃腌制食品、有胃溃疡疾病史、近亲有胃癌疾病史及上消化道症状反复时间为胃癌发病的独立危险因素，提示暴露于以上环境因素、饮食习惯及遗传因素可能增加胃黏膜与致癌物质的接触机会，从而并削弱黏膜慢性炎症损伤修复的能力，继而导致慢性胃炎发展为胃癌。建议您去医疗机构检查，并积极治疗，同时在环境因素及饮食习惯上需多注意，杜绝不良因素诱导，健康生活！\n    ");
                                }
                                if(sicks.contains("肝硬化")
                                        ||sicks.contains("肥胖")
                                        ||sicks.contains("糖尿病")
                                        ||sicks.contains("非酒精性脂肪肝")
                                        ||sicks.contains("脂肪肝")
                                        ||sicks.contains("肝病")){
                                    sb1.append("大量证据表明，肝癌的发生是一个多阶段、多因素共同累积的结果，其发生过程是由体外致癌因素联合自身免疫缺陷、基因水平等一系列因素导致的。肝癌病因复杂，包括不可控因素及可控制因素，不可控因素包括性别、年龄、血型、宿主遗传、基因类型及基因突变等。饮酒与吸烟是肝癌发生的危险因素之一，另外还有健康状况方面代谢综合征如肝硬化、肥胖、糖尿病、非酒精性脂肪肝以及社会心理及精神因素肝癌发生的危险因素之一。\n    ");
                                }
                                if(sicks.contains("肺炎")||sicks.contains("支气管炎")){
                                    sb1.append("研究证实，气管炎是并发肺癌的主要原因，减少气管炎患者的人数将大大减少肺癌的发病率。气管感染的患者促使肺脏内的炎症因子的释放，浸润并作用于肺内的细胞，分泌IL-1、IL-6等细胞因子及肿瘤的坏死因子及其他相关因子。这些因子将作用于肺脏细胞，引起细胞的反应，最后导致肺癌发生。鉴于您有炎症，您首先积极治疗炎症，减轻肺脏的负担，同时一定不要抽烟，并远离二手烟接触，为您的健康保驾护航！\n    ");
                                }
                                if(sicks.contains("吸烟")){
                                    sb1.append("您有长时间吸烟史，香烟中的尼古丁、亚硝胺等物质可导致基因甲基化而诱导癌症的发生。主动吸烟和被动吸烟分别作为肺癌、肝癌患病的危险因素已经被世界范围内大量的流行病学调查所证实，且被动吸烟者宫颈黏液中烟草相关致癌物质含量高于主动吸烟者。建议您远离吸烟场所，减少接触癌症诱发的因素。\n    ");
                                }
                                if(sicks.contains("饮酒")){
                                    sb1.append("酒精被认为是可能诱发肝癌的危险因素。大量饮酒可促进肝癌发生。大数据分析结果表明，饮酒25 g·d-1及以上是肝癌的危险因素，并有随着每日饮酒量的增加，肝癌发病率增加的趋势。主要原因为：一方面，酒精可增加乳腺上皮细胞膜的通透性，通过乙醇诱导酶而增加致病因子的代谢，抑制DNA的损伤修复。您有饮酒习惯。建议您远离酒精，健康生活。\n    ");
                                }
                                sb1.insert(0,"\n    ");
                                if(sb1.toString().endsWith("\n    ")) {
                                    sb1.delete(sb1.length() - 5, sb1.length());
                                }
                                entity.setResOnes(sb1.toString());
                                StringBuffer sb2 = new StringBuffer();
                                if(sicks.contains("高血压")){
                                    sb2.append("高血压是白内障的一个重要危险因素，长期罹患高血压，尤其是高收缩压状态能够促进白内障的发生和发展。体质指数（体质指数（BMI）=体重（kg）÷身高^2（m）。成人的BMI数值：过轻：低于18.5；正常：18.5-23.9；过重：24-27；肥胖：28-32；非常肥胖, 高于32）增高与白内障呈正相关，超重者患高血压发生白内障的危险性显著增高。因此应该倡导健康的生活方式，如参加更多的体力活动、合理膳食、减轻体质量、维持正常血压等，可有助于预防白内障的发生。鉴于您有高血压，建议您积极首先积极治疗高血压，同时合理膳食，保持正常体质指数，健康生活。\n    ");
                                }
                                if(sicks.contains("冠心病")
                                        ||sicks.contains("脑供血不足")
                                        ||sicks.contains("动脉硬化")
                                        ||sicks.contains("心脏病")){
                                    sb2.append("您有心脑血管或相关疾病，建议您适当增加锻炼，健康饮食，舒心生活！\n    ");
                                }
                                if(sicks.contains("糖尿病")){
                                    sb2.append("大量研究表明，糖尿病并发症有：糖尿病肾病、糖尿病眼病、糖尿病足病、糖尿病心血管病、糖尿病脑血管病等，鉴于您患有糖尿病，建议您密切关注以上疾病，同时积极治疗、控制血糖。\n      ");
                                }
                                sb2.insert(0,"\n    ");
                                if(sb2.toString().endsWith("\n    ")) {
                                    sb2.delete(sb2.length() - 5, sb2.length());
                                }
                                entity.setResTwos(sb2.toString());
                            }

                            if(sicks.contains("高血压")&&!sicks.contains("糖尿病")){
                                entity.setHelthManage("高血压健康管理");
                                entity.setHelthManageContent("1.高血压的病因\n" +
                                        "继发性高血压：是由其他疾病引起的、有明确的起因的，如：肾实质性高血压、肾血管性高血压、内分泌性高血压、血管性高血压、药物诱发性高血压等；原发性高血压：是没有明确特定的原因、由于遗传或环境因素（生活习惯）等综合原因所致的高血压，占高血压患者的95%左右，是预防和健康教育、健康管理的重点。\n" +
                                        "国内外大规模的流行病学研究证明：高血压的病因，遗传因素的比重占30%-40%，生活习惯的比重占60%-70%。高血压在很大程度上是一种可以预防的疾病，健康教育、健康干预、健康管理对高血压的预防有非常重要的意义。\n" +
                                        "2.高血压的危险因素\n" +
                                        "目前比较公认的导致高血压的生活方式有高盐饮食、肥胖、体力活动过少、过量饮酒、精神高度紧张等；\n" +
                                        "口服避孕药后血压均有所上升，避孕药促使血压升高的主要原因与避孕药中的激素有关。口服避孕药引起的高血压通常是可逆的，且升高程度比较轻微，当停止服用避孕药半年左右，血压就能恢复正常。 \n" +
                                        "3.高血压的预防与健康管理\n" +
                                        "3.1 饮食健康管理\n" +
                                        "饮食对于高血压的重要性：民以食为天，合理的膳食可以使你不胖也不瘦，胆固醇不高也不低。 \n" +
                                        "3.1.1 高血压患者的饮食宜忌\n" +
                                        "①碳水化合物食品： \n" +
                                        "适宜的食品---米饭、粥、面、面类、葛粉、汤、芋类、软豆类。 \n" +
                                        "应忌的食品---蕃薯（产生腹气的食物）、干豆类、味浓的饼干类。 \n" +
                                        "②蛋白质食品：\n" +
                                        "适宜的食品---牛肉、猪瘦肉、白肉鱼、蛋、牛奶、奶制品（鲜奶油、酵母乳、冰淇淋、乳酪）、大豆制品（豆腐、纳豆、黄豆粉、油豆腐）。 \n" +
                                        "应忌的食物---脂肪多的食品（牛、猪的五花肉、排骨肉、鲸鱼、鲱鱼、金枪鱼等、加工品（香肠）。 \n" +
                                        "③脂肪类食品：\n" +
                                        "适宜的食品---植物油、少量奶油、沙拉酱。\n" +
                                        "应忌的食品---动物油、生猪油、熏肉、油浸沙丁鱼。\n" +
                                        "④维生素、矿物质食品： \n" +
                                        "适宜的食品---蔬菜类（菠菜、白菜、胡萝卜、番茄、百合根、南瓜、茄子、黄瓜）、水果类（苹果、桔子、梨、葡萄、西瓜）、海藻类、菌类宜煮熟才吃。 \n" +
                                        "应忌的食物---纤维硬的蔬菜（牛蒡、竹笋、豆类）、刺激性强的蔬菜（香辛蔬菜、芒荽、芥菜、葱、芥菜）。 \n" +
                                        "⑤其他食物： \n" +
                                        "适宜的食品---淡香茶、酵母乳饮料。 \n" +
                                        "应忌的食物---香辛料（辣椒、咖喱粉）、酒类饮料、盐浸食物（成菜类、成鱼子）、 酱菜类、咖啡。 \n" +
                                        "3.1.2 高血压病人应注意的饮食习惯\n" +
                                        "①首先要控制能量的摄入。提倡吃复合糖类、如淀粉、玉米、少吃葡萄糖、果糖及蔗糖，这类糖属于单糖，易引起血脂升高；\n" +
                                        "②限制脂肪的摄入。烹调时，选用植物油，可多吃海鱼，海鱼含有不饱和脂肪酸，能使胆固醇氧化，从而降低血浆胆固醇，还可延长血小板的凝聚，抑制血栓形成，防止中风，还含有较多的亚油酸，对增加微血管的弹性，防止血管破裂，防止高血压并发症有一定的作用；\n" +
                                        "③适量摄入蛋白质。高血压病人每日蛋白质的量为每公斤体重1g为宜。每周吃2-3次鱼类蛋白质，可改善血管弹性和通透性，增加尿钠排出，从而降低血压。如高血压合并肾功能不全时，应限制蛋白质的摄入； \n" +
                                        "④多吃含钾、钙丰富而含钠低的食品，如土豆、茄子、海带、莴笋。含钙高的食品：牛奶、酸牛奶、虾皮。少吃肉汤类，因为肉汤中含氮浸出物增加，能够促进体内尿酸增加，加重心、肝、肾脏的负担； \n" +
                                        "⑤限制盐的摄入量：每日应逐渐减至6g以下，即普通啤酒盖去掉胶垫后，一平盖食盐约为6g。这量指的是食盐量包括烹调用盐及其他食物中所含钠折合成食盐的总量。适当的减少钠盐的摄入有助于降低血压，减少体内的钠水潴留； \n" +
                                        "⑥多吃新鲜蔬菜、水果。每天吃新鲜蔬菜不少于8两，水果2至4两； \n" +
                                        "⑦适当增加海产品摄入：如海带，紫菜，海产鱼等。\n" +
                                        "3.2 运动健康管理\n" +
                                        "体力活动过少可引起中心性肥胖，胰岛素抵抗以及自主神经调节功能下降，从而导致高血压发生。\n" +
                                        "运动降低血压的原理：运动能降低交感神级张力，减少茶酚胺释放，使外周血管阻力下降；运动还能降低肾素-血管紧张素系统活性，从而使血管扩张利钠利水，降低血容量，使血压下降。\n" +
                                        "每天30分钟快走，坚持10周，可使收缩压降低10mmHg。坚持适度而有规律的体育锻炼，如慢跑、骑自行车、游泳、球类运动、健美操等以及适度的体力劳动有助于减轻体重、降低血压和提高机体免疫力。我国传统的运动和医疗保健方法，如气功和太极拳，能增进人体健康，对高血压的防治也能起到良好的作用。\n" +
                                        "应在医生的指导下进行，运动量要循序渐进，从轻度运动开始，逐渐加大运动量，但决不能勉强。任何引起体力消耗的活动均有健康效应，如散步、上楼梯、多站立等。\n" +
                                        "有氧运动对改善机体代谢功能和降低血压的作用更好。\n" +
                                        "运动还可以增加高密度脂蛋白胆固醇(HDL-C)的浓度，改善胆固醇的代谢，预防动脉粥样硬化。 \n" +
                                        "3.2.1 进行运动的注意事项\n" +
                                        "①勿过量或太强太累，要采取循序渐进的方式来增加活动量；\n" +
                                        "②注意周围环境气候。夏天：避免中午艳阳高照的时间；冬天：要注意保暖，防中风； \n" +
                                        "③穿着舒适吸汗的衣服：选棉质衣料，运动鞋等是必要的； \n" +
                                        "④选择安全场所：如公园、学校，勿在巷道、马路边； \n" +
                                        "⑤进行运动时，切勿空腹，以免发生低血糖，应在饭后2小时。 \n" +
                                        "3.2.2 运动的禁忌 \n" +
                                        "①生病或不舒服时应停止运动；\n" +
                                        "②饥饿时或饭后一小时不宜做运动；\n" +
                                        "③运动中不可立即停止，要遵守运动程序的步骤；\n" +
                                        "④运动中有任何不适现象，应即停止。\n" +
                                        "3.3 生活习惯健康管理\n" +
                                        "吸烟会导致高血压。研究证明，吸一支烟后心率每分钟增加5 -20次/分，收缩压增加10-25mmhg。这是为什么呢？因为烟叶内含有尼古丁（烟碱）会兴奋中枢神经和交感神经，使心率加快，同时也促使肾上腺释放大量儿茶酚胺，使小动脉收缩，导致血压升高。尼古丁还会刺激血管内的化学感受器，反射性地引起血压升高。长期大量吸烟还会促进大动脉粥样硬化，小动脉内膜逐渐增厚，使整个血管逐渐硬化。同时由于吸烟者血液中一氧化碳血红蛋白含量增多，从而降低了血液的含氧量，使动脉内膜缺氧，动脉壁内脂的含氧量增加，加速了动脉粥样硬化的形成。因此，无高血压的人戒烟可预防了高血压的发生，有高血压的人更应戒烟。 \n" +
                                        "与吸烟相比，饮酒对身体的利弊就存在争议。不时出现各种报告，有的说饮少量酒有益，有的说有害，但可以肯定的一点是，大量饮酒肯定有害，高浓度的酒精会导致动脉硬化，加重高血压。\n" +
                                        "3.4 心理健康管理\n" +
                                        "高血压患者的心理表现是紧张、易怒、情绪不稳，这些又都是使血压升高的诱因。由于紧张的刺激引起血中儿茶酚胺类激素升高，导致血压升高，心跳加快。患者可通过改变自己的行为方式，培养对自然环境和社会的良好适应能力，避免情绪激动及过度紧张、焦虑，遇事要冷静、沉着；当有较大的精神压力时应设法释放，向朋友、亲人倾吐或鼓励参加轻松愉快的业余活动，将精神倾注于音乐或寄情于花卉之中，使自己生活在最佳境界中，从而维持稳定的血压。\n" +
                                        "从而有高血压倾向的人应修身养性，陶冶情操，保持良好的心理状态和情绪，养成良好的生活习惯，多参加一些富有情趣的体育和文化娱乐活动，丰富自己的业余生活。\n" +
                                        "4.相关检测管理\n" +
                                        "4.1 高血压的相关检查及其意义\n" +
                                        "①心电图和超声心动图检查，以判断有无左心室肥厚和心律紊乱；\n" +
                                        "②X线及其他检查(必要时行血管造影、CT检查定位诊断)，以判断有无主动脉扩张、延长或缩窄；\n" +
                                        "③尿常规及肾功能检查，检查尿蛋白、尿糖、血肌酐、尿素氮、血钾、血尿酸水平；\n" +
                                        "④眼底检查眼底动脉硬化程度；\n" +
                                        "⑤血糖、血脂及血钙水平检查；\n" +
                                        "⑥有条件者在治疗前做24小时动态血压检测；\n" +
                                        "⑦年轻高血压患者应做肾上腺B超检查。\n" +
                                        "4.2 高血压的监测\n" +
                                        "①定期测量血压，1-2周应至少测量一次； \n" +
                                        "②治疗高血压应坚持“三心”，即信心、决心、恒心，只有这样做才能防止或推迟机体重要脏器受到损害；\n" +
                                        "③定时服用降压药，自己不随意减量或停药，可在医生指导下及现病情加予调整，防止血压反跳； \n" +
                                        "④条件允许，可自备血压计及学会自测血压；\n" +
                                        "⑤随服用适当的药物外，还要注意劳逸结合、注意饮食、适当运动、保持情绪稳定、睡眠充足； \n" +
                                        "⑥老年人降压不能操之过急，血压宜控制在140-159mmhg为宜，减少心脑血管并发症的发生； \n" +
                                        "⑦老年人及服用去甲肾上腺素能神经末梢阻断药的防止体位性低血压； \n" +
                                        "⑧不需要严格禁止性生活：注意以下几种情况，不宜进行性生活：事后不要立即进行房事、酒后应禁止性生活、若有头晕，胸闷等不适应停止性生活，并及时就医；\n" +
                                        "⑨服完药、血压升高或过低、血压波动大、出现眼花、头晕、恶心呕吐、视物不清、偏瘫、失语、意识障碍、呼吸困难、肢体乏力等即到医院就医。如病情危重，请求救120急救中心。");
                            }else if(sicks.contains("糖尿病")&&!sicks.contains("高血压")){
                                entity.setHelthManage("糖尿病健康管理");
                                entity.setHelthManageContent("1.糖尿病饮食原则\n" +
                                        "①减轻胰岛负担，使血糖、血脂达到或接近正常值，并防止或延缓心血管等并发症的发生与发展。\n" +
                                        "②维持健康，使成人能从事各种正常的活动，儿童能正常地生长发育。\n" +
                                        "③维持正常的体重。肥胖者减少能摄入，可以改善受体对胰岛素的敏感性。消瘦者双可使体重增加，以增强对种传染的抵抗力。\n" +
                                        "2.糖尿病患者饮食宜忌\n" +
                                        "2.1 糖尿病患者吃什么好\n" +
                                        "①谷类：包括米、面等主食。粗杂粮如莜麦面、荞麦面、燕麦片、玉米面、三合面(玉米、黄豆、白面按2：2：1比例做成)，含有多量维生素B和食物纤维。实验证明，它们有延缓血糖升高的作用。\n" +
                                        "②大豆及其制品：除富含蛋白质、无机盐和维生素外，豆油中还有较多的ｗ-3多不饱和脂肪酸，既能降低血胆固醇，又能降低血清甘油三酯，所含的谷丙醇也有降脂作用。但如果已发生糖尿病肾病，则不宜再食豆制品。\n" +
                                        "③畜禽鱼类：均含丰富的蛋白质，一般在20%左右，含碳水化合物极少。白色的瘦肉如禽肉和鱼肉含饱和脂肪酸较少，且鱼油特别是深海鱼油含较多的不饱和脂肪酸，对糖尿病有利，红色的瘦肉如畜肉含较多的饱和脂肪酸，应少吃。\n" +
                                        "④乳类：牛奶等乳类制品营养丰富，所含的碳水化合物主要为乳糖，是由一分子的葡萄糖和一分子的半乳糖组成，这两个单糖在肠道吸收均很快。成年后，肠道内的乳糖酶明显减少，多相对缺乏，故分解慢，对血糖影响较小。牛奶中所含蛋白质的量亦较高，且为优质蛋白质，并含有丰富的维生素、微量元素及钙，均有利于糖尿病，所以糖尿病患者可以适量饮用，一般每天以250-500ml为宜。但其中所含脂肪比例较高，故有高脂血症者可改服脱脂牛奶。\n" +
                                        "⑤蛋类：主要含优质蛋白质，一般为13%，含碳水化合物很少，多在3%以下，故适合糖尿病患者食用，但其蛋黄中脂肪特别是胆固醇含量很高，故高脂血症者应只吃蛋白不吃蛋黄。\n" +
                                        "⑥油脂类：烹调油是富含脂肪的食物，应按定量食用，尽量用植物油代替动物油。为减少饱和脂肪酸的摄入，多用含不饱和脂肪酸较多的豆油、玉米油等。\n" +
                                        "⑦蔬菜类：蔬菜一般含热量很低，大多在3%以下，主要提供维生素、矿物质、微量元素和食物纤维等。花叶类蔬菜含蛋白质、脂肪和碳水化合物均很少，糖尿病患者可任意选用，有时可以作为充餐食物和加餐食品。海洋植物含有较多的碘及可溶性纤维，对身体有利。瓜类与花叶类接近，特别是苦瓜、南瓜等对糖尿病有一定益处。但根茎类则含有大量碳水化合物，如马铃薯等，应作为主食看待。\n" +
                                        "⑧水果类：水果含有丰富的维生素C、矿物质、水分、纤维素和果糖，味道鲜美，色彩夺人，能激发食欲，对糖尿病患者有益。尤其是果胶，有延缓葡萄糖吸收的作用。水果所含的葡萄糖、果糖和蔗糖等约为6%-20%，所含葡萄糖对糖尿病不利，但果糖则影响较小，其对血糖的影响与其他含多糖类食物类似，故国外的糖尿病专家主张对水果不予限制，但应计入每天的总热量。传统认为，水果可以吃，但应适量。病情控制较好，空腹血糖≤6.89mmol／L(140mg／d1)者，可以适当进食水果。吃水果的时间应在两餐之间，此时血糖较低，吃一点含糖的水果，血糖不会明显升高，餐后吃水果就等于加餐了，血糖会高起来。在选择水果时，应选择含糖量最低的水果，如苹果、 鸭梨、橘子、橙子、李子、草莓、菠萝等。香蕉、干果中的栗子、白果等主要成分是淀粉，食用量应计入主食量。一般而言，每天吃200g水果就要相应减少 25g的粮食。\n" +
                                        "⑨甜味剂\n" +
                                        "a．蔗糖：在血糖控制较好时可以适当进食，但应控制在总热量的5%以下，而且应与其他食物一起混合进食。\n" +
                                        "b．果糖：比起蔗糖和大多数淀粉，进食果糖对血糖的影响较小，因此用果糖作为甜味剂是有好处的。但多食果糖可能会引起血清胆固醇和低密度脂蛋白胆固醇的升高，因此有高血脂症的患者最好少吃。\n" +
                                        "c．木糖醇、山梨醇等糖醇：是具有甜味的碳水化合物，吸收率低，一般为葡萄糖的六分之一左右，故食后不容易引起血糖增高，而且产热量少，1g仅产热量不到 8.36kJ，肠道吸收不完全，因此可以用作甜味剂，但应计入总热量。每天最多不要超过50g，以防因吸收不完全引起渗透性腹泻。\n" +
                                        "d．不含热量和营养素的甜味剂：如糖精、蛋白糖、甜叶菊片等，均具有很高的甜度，代谢时不需胰岛素，不会引起血糖升高。糖精的甜度是蔗糖的300-500倍，但大量摄入糖精有诱发膀胱癌的作用，不宜多用。而且因其可通过胎盘，孕妇不宜食用。蛋白糖即天冬氨酸苯丙氨酸甲酯，其甜度为蔗糖的200倍，甜味纯正，直至目前未见明显副作用，为较理想的甜味剂。甜叶菊片是从甜叶菊中提取，甜度与糖精相似，应用较广。\n" +
                                        "2.2糖尿病患者吃什么不好？\n" +
                                        "①易使血糖迅速升高的食物\n" +
                                        "白糖、红糖、冰糖、葡萄糖、麦芽糖、蜂蜜、奶糖、蜜饯、水果糖、巧克力、水果罐头、甜饮料、甜饼干、甜面包、果汁、果酱、汽水、蛋糕及糖制糕点等。\n" +
                                        "②易使血脂升高的食物\n" +
                                        "牛油、羊油、猪油、黄油、奶油、肥肉、猪皮、鸭皮、猪肠等。对富有胆固醣的食物应特别注意，应该不用或少用，以防止动脉硬化性心脏病的发生，如动物内脏(肝、脑、肾、心)、蟹黄、鱼卵、虾卵、蛋黄等。\n" +
                                        "2.3糖尿病患者宜少吃的食品\n" +
                                        "①太咸的食品：如腌制品酱菜等。\n" +
                                        "②含油多、热量较高的坚果类：花生、瓜子、腰果、松子、核桃、杏仁、开心果等。\n" +
                                        "③油腻食物：如油炸、油酥食品。\n" +
                                        "3.糖尿病患者食疗方法\n" +
                                        "3.1药粥\n" +
                                        "适合糖尿病患者食用的药粥有：\n" +
                                        "豆腐浆粥（《本草纲目拾遗》）：粳米50g，豆腐浆500mL，食盐或白糖少许，先煮粳米，后加豆腐浆，至米开花粥稠，分早晚2次服用。适用于糖尿病伴高血压、冠心病者，若糖尿病肾病肾衰者不宜服用。\n" +
                                        "绿豆粥（《普济方》）：粳米50g，绿豆50g，共煮粥食用。绿豆有降血脂作用，适用于糖尿病伴高血压、冠心病者，若糖尿病肾病肾衰者不宜服用。\n" +
                                        "赤小豆鱼粥（经验方）：赤小豆50g，鲤鱼1尾，先煮鱼取汁，后加赤小豆煮烂。适用于糖尿病水肿者。\n" +
                                        "菠菜粥（《本草纲目》）：菠菜100～150g，粳米50g，煮粥食用。适用于糖尿病阴虚化热型。便溏腹泻者禁服。\n" +
                                        "芹菜粥（《本草纲目》）：新鲜芹菜60～100g切碎，粳米100g，煮粥服用。适用于糖尿病合并高血压者。\n" +
                                        "木耳粥（《鬼遗方》）：银耳5～10g（或黑木耳30g），粳米100g，大枣3枚。先浸泡银耳，将粳米、大枣煮熟后加银耳，煮粥食。适用于糖尿病血管 病变者，美国明尼索达大学医学院汉穆希密特教授认为，常食木耳可以减少和预防心脏病的发作。木耳有破血作用，糖尿病孕妇慎用。\n" +
                                        "萝卜粥（《图经本草》）：新鲜白萝卜适量，粳米50g，煮粥服用。适用于糖尿病痰气互结者。\n" +
                                        "山药粥（《医学衷中参西录》）：生山药60g，大米60g，先煮米为粥，山药为糊，酥油蜜炒合凝，用匙揉碎，放入粥内食用。适用于糖尿病脾肾气虚、腰酸乏力、便泄者。\n" +
                                        "胡萝卜粥（《本草纲目》）：新鲜胡萝卜50g、粳米100g，煮粥服用，适用于糖尿病合并高血压者。药理研究：胡萝卜中琥珀酸钾盐有降压作用。\n" +
                                        "冬瓜鸭粥（验方）：冬瓜一个，光鸭一只，大米200g，香菇10个，陈皮3g。先将鸭于油锅煎爆至香，用葱、姜调味，入粥煮烂捞起切片。食鸭服粥。适用于糖尿病合并高血压者。\n" +
                                        "槐花粥（验方）：干槐花30g或鲜品50g，大米50g，煮粥服用。适用于糖尿病合并高血压、中风患者。槐花可扩张冠状动脉，可防治动脉硬化，常服用有预防中风作用。\n" +
                                        "菊花粥（《老老恒言》）：秋菊烘干研末，先以粳米100g煮粥。调入菊花末10g稍煮一二沸即可服用。适用于糖尿病视物昏花者。菊花清肝明目，临床用于防治高血压、冠心病、高脂血症。\n" +
                                        "玉米粉粥（《食物疗法》）：粳米50-100g，加水煮至米开花后，调入玉米粉30g（新鲜玉米粉），稍煮片刻服用。适用于各种糖尿病人。玉米含蛋白质、脂肪、糖类、维生素和矿物质，玉米油是一种富含多个不饱和脂肪酸的油脂，是一种胆固醇吸收抑制剂。\n" +
                                        "荔枝粥（《泉州本草》）：荔枝5-7个，粳米50g，水适量煮粥服用。适用于Ⅱ型糖尿病者。\n" +
                                        "葛根粉粥（《太平圣惠方》）：葛根粉30g，粳米50g，共煮粥服用。适用于老年人糖尿病，或伴有高血压、冠心病者，葛根含黄酮类，具有解热、降血脂、降低血糖作用。\n" +
                                        "生地黄粥（《月瞿仙神隐》）：鲜生地150g洗净捣烂取汁，先煮粳米50g为粥，再加入生地汁，稍煮服用。适用于气阴两虚型糖尿病者。\n" +
                                        "杞子粥（《本草纲目》）：枸杞子15-20g，糯米50g，煮粥服用。适用于糖尿病肝肾阴虚者。\n" +
                                        "葫芦粥（经验方）：陈葫芦10g，粳米50g煮粥服用，适用于糖尿病水肿者。\n" +
                                        "天花粉粥（《千金方》）：花粉30g，温水浸泡2小时，加水200mL，煎至100mL，入粳米50g煮粥服用。适用糖尿病口渴明显者，糖尿病孕妇禁用。\n" +
                                        "韭子粥（《千金翼方》）：韭子10g炒熟，粳米50g，煮粥服用，适用于糖尿病性阳痿病人。\n" +
                                        "3.2菜肴与药膳\n" +
                                        "适合糖尿病患者食用的菜肴与药膳有：\n" +
                                        "苦瓜：清热解毒，除烦止渴，动物实验表明苦瓜有明显降低血糖作用。糖尿病人常食苦瓜有一定降低血糖作用，可用鲜苦瓜作菜食用或红烧苦瓜，每次100g。糖尿病脾胃虚寒者不宜服用。\n" +
                                        "蚌肉苦瓜汤：苦瓜250g，蚌肉100g，共煮汤，加油盐调味，熟后喝汤吃苦瓜蚌肉。适用于轻型糖尿病。\n" +
                                        "南瓜：具有降低血糖、血脂作用。国内外临床研究表明，南瓜粉对轻型糖尿病确有疗效。可将南瓜烘干研粉，每次5g，每日3次，也可用鲜南瓜250g煮熟食用，既充饥又可降低血糖。\n" +
                                        "洋葱（葱头）：味淡性平，具有降低血糖作用，也用洋葱50-100g水煎服，也可作菜食用。\n" +
                                        "玉米须煲瘦猪肉：玉米须30g，瘦猪肉100g，煮熟饮汤食肉，适用于一般糖尿病患者。\n" +
                                        "枸杞子蒸鸡：枸杞子15g，母鸡1只加料酒、姜、葱、调料，共煮熟食枸杞子、鸡肉，饮汤。适用于糖尿病肾气虚弱者。\n" +
                                        "苦瓜焖鸡翅：苦瓜250g，鸡翅膀1对，姜汁、黄酒、调料、植物油适量，先炒鸡翅膀，后入苦瓜、调料，熟后食肉饮汤。\n" +
                                        "沙参玉竹煲老鸭：沙参30～50g，玉竹30g，老雄鸭一只，葱、姜、盐少许焖煮熟后食肉，饮汤。适用于中老年糖尿病。\n" +
                                        "清蒸茶鲫鱼：鲫鱼500g，绿茶20g左右，蒸熟，淡食鱼肉。适用于糖尿病。\n" +
                                        "萝卜煲鲍鱼：干鲍鱼20g，鲜萝卜250g，加水煲熟，食肉饮汤。适用于一般糖尿病患者。\n" +
                                        "黄鳝：具有一定降糖作用。用黄鳝制做的药膳有：参蒸鳝段，内金鳝鱼，烩鳝鱼丝，归参鱼鳝，翠皮爆鳝丝等均可选用。\n" +
                                        "清炖甲鱼：活甲鱼500g，葱、姜、笋片、酒适量，炖熟饮汤。适用于老年糖尿病肾阴不足患者。\n" +
                                        "韭菜煮蛤蜊肉：韭菜250g，蛤蜊肉250g，料酒、姜、盐少许，煮熟饮汤食肉，适用于糖尿病肾阴不足者。\n" +
                                        "玉米须炖龟：玉米须100g，乌龟1只，葱、盐、料酒适量，炖熟食肉饮汤。适用于一般糖尿病患者。\n" +
                                        "玉米须炖蚌肉：玉米须100g，蚌肉150g，盐、葱、料酒适量。炖熟食饮汤，适用于一般糖尿病患者。\n" +
                                        "田螺：具有一定降血糖作用，大田螺10至20个，盐、姜、葱少许，煮熟食螺饮汤。\n" +
                                        "鳕鱼：鳕鱼胰腺含有丰富的胰岛素，可炖食。适用于各型糖尿病患者。\n" +
                                        "蚕蛹：洗净后用植物油炒，或煎成汤剂。适用于各型糖尿病患者。\n" +
                                        "海参：洗净炒食可用于各型糖尿病。\n" +
                                        "鲜蘑炒豌豆：鲜口蘑100g，鲜嫩豌豆150g，植物油、盐少许。适用于各型糖尿病人。\n" +
                                        "其他菜类：素炒豌豆、素炒豆芽菜、素炒冬瓜、素炒菠菜、炒绿豆芽、香干丝炒芹菜、冬菇烧白菜等均适宜糖尿病食用。\n" +
                                        "3.3汤类、饮料\n" +
                                        "糖尿病患者宜于饮用的汤类、饮料有：\n" +
                                        "冬瓜瓤汤（《圣惠方》）：冬瓜瓤（干品）30g水煎代茶饮。\n" +
                                        "葫芦汤：鲜葫芦60g，或干品30g，水煎饮汤。适用于糖尿病皮肤疖肿。\n" +
                                        "赤小豆冬瓜汤：赤小豆、冬瓜适量煎汤。适用于糖尿病皮肤疖肿。\n" +
                                        "糯米桑皮汤：爆糯米花30g，桑白皮30g，水煎服。适用于糖尿病口渴多饮者。\n" +
                                        "菠菜银耳汤：鲜菠菜根150～200g，银耳20g，饮汤食银耳，适用于糖尿病大便秘结者。\n" +
                                        "兔肉汤：兔1只，盐调料，煮熟食肉饮汤。\n" +
                                        "鸽肉银耳汤：白鸽半只，银耳15g，煮熟食肉饮汤。适用于各型糖尿病。\n" +
                                        "鸽肉山药玉竹汤：白鸽1只，山药30g，玉竹20g，共煮熟食肉饮汤。适用于阴虚型糖尿病。\n" +
                                        "猪胰汤：猪胰一个，黄芪60g，山药120g，水煎汤，食猪胰，饮汤。猪胰子焙干研末，每次6～9g，每日3次。适用于各型糖尿病。\n" +
                                        "双耳汤：白木耳、黑木耳各10g，冰糖少许，白木耳、黑木耳洗净加清水蒸至木耳熟烂，食木耳饮汤。适用于糖尿病人眼底出血症。\n" +
                                        "菊槐绿茶饮：菊花、槐花、绿茶各3g，沸水冲泡饮用。适用于糖尿病伴高血压患者。\n" +
                                        "苦瓜茶饮：鲜苦瓜一个，绿茶适量，温水冲泡。适用于轻型糖尿病。\n" +
                                        "消渴茶（《外台秘要》）：麦冬、玉竹各15g，黄芪、通草各100g，茯苓、干姜、葛根、桑白皮各50g，牛蒡根150g，干生地、枸杞根、银花藤、薏苡仁各30g，菝葜24g，共研末制成药饼，每个15g，每取一个放火上令香熟勿焦，研末代茶饮。\n" +
                                        "地骨皮露（《全国中药成药处方集》）：地骨皮300g，为细末，用蒸馏方法，成露1500g，每服60g，一日2次。\n" +
                                        "消渴速溶饮：鲜冬瓜皮和西瓜皮各1000g，白糖适量，瓜蒌根250g。瓜皮切薄片，瓜蒌根捣碎水泡，放锅内水适量煮1小时，捞去渣再以小火继续加煎煮 浓缩，至稠粘停火，待温，加白糖粉，把煎液吸净、拌匀、晒干、压碎，每次10g，以沸水冲化，频饮代茶。适用于各型糖尿病。\n" +
                                        "白萝卜汁（《食医心镜》）：白萝卜1000g，洗净捣烂，纱布包绞汁，每次50mL，每日3次。\n" +
                                        "鲜李汁（《泉州本草》）：鲜熟李子适量，切碎绞汁，每次1汤匙，一日3次。\n" +
                                        "乌梅茶：乌梅15g，沸水冲泡代茶饮。\n" +
                                        "黄精枸杞茶：黄精15g，枸杞10g，绿茶3g，温开水冲泡代茶饮。\n" +
                                        "鲜生地露（《消渴病中医防治》）：鲜生地500g，切成小块，制露1000g，每服100g，具有滋肾养阴，生津止渴作用。\n" +
                                        "麦冬茶（《消渴病中医防治》）：麦冬、党参、北沙参、玉竹、花粉各9g，乌梅、知母、甘草各6g，共为细末，每服1剂，白开水冲，代茶饮。");
                            }else if(sicks.contains("高血压")&&sicks.contains("糖尿病")){
                                entity.setHelthManage("健康管理");
                                entity.setHelthManageContent("高血压的健康管理\n" +
                                        "1.高血压的病因\n" +
                                        "继发性高血压：是由其他疾病引起的、有明确的起因的，如：肾实质性高血压、肾血管性高血压、内分泌性高血压、血管性高血压、药物诱发性高血压等；原发性高血压：是没有明确特定的原因、由于遗传或环境因素（生活习惯）等综合原因所致的高血压，占高血压患者的95%左右，是预防和健康教育、健康管理的重点。\n" +
                                        "国内外大规模的流行病学研究证明：高血压的病因，遗传因素的比重占30%-40%，生活习惯的比重占60%-70%。高血压在很大程度上是一种可以预防的疾病，健康教育、健康干预、健康管理对高血压的预防有非常重要的意义。\n" +
                                        "2.高血压的危险因素\n" +
                                        "目前比较公认的导致高血压的生活方式有高盐饮食、肥胖、体力活动过少、过量饮酒、精神高度紧张等；\n" +
                                        "口服避孕药后血压均有所上升，避孕药促使血压升高的主要原因与避孕药中的激素有关。口服避孕药引起的高血压通常是可逆的，且升高程度比较轻微，当停止服用避孕药半年左右，血压就能恢复正常。 \n" +
                                        "3.高血压的预防与健康管理\n" +
                                        "3.1 饮食健康管理\n" +
                                        "饮食对于高血压的重要性：民以食为天，合理的膳食可以使你不胖也不瘦，胆固醇不高也不低。 \n" +
                                        "3.1.1 高血压患者的饮食宜忌\n" +
                                        "①碳水化合物食品： \n" +
                                        "适宜的食品---米饭、粥、面、面类、葛粉、汤、芋类、软豆类。 \n" +
                                        "应忌的食品---蕃薯（产生腹气的食物）、干豆类、味浓的饼干类。 \n" +
                                        "②蛋白质食品：\n" +
                                        "适宜的食品---牛肉、猪瘦肉、白肉鱼、蛋、牛奶、奶制品（鲜奶油、酵母乳、冰淇淋、乳酪）、大豆制品（豆腐、纳豆、黄豆粉、油豆腐）。 \n" +
                                        "应忌的食物---脂肪多的食品（牛、猪的五花肉、排骨肉、鲸鱼、鲱鱼、金枪鱼等、加工品（香肠）。 \n" +
                                        "③脂肪类食品：\n" +
                                        "适宜的食品---植物油、少量奶油、沙拉酱。\n" +
                                        "应忌的食品---动物油、生猪油、熏肉、油浸沙丁鱼。\n" +
                                        "④维生素、矿物质食品： \n" +
                                        "适宜的食品---蔬菜类（菠菜、白菜、胡萝卜、番茄、百合根、南瓜、茄子、黄瓜）、水果类（苹果、桔子、梨、葡萄、西瓜）、海藻类、菌类宜煮熟才吃。 \n" +
                                        "应忌的食物---纤维硬的蔬菜（牛蒡、竹笋、豆类）、刺激性强的蔬菜（香辛蔬菜、芒荽、芥菜、葱、芥菜）。 \n" +
                                        "⑤其他食物： \n" +
                                        "适宜的食品---淡香茶、酵母乳饮料。 \n" +
                                        "应忌的食物---香辛料（辣椒、咖喱粉）、酒类饮料、盐浸食物（成菜类、成鱼子）、 酱菜类、咖啡。 \n" +
                                        "3.1.2 高血压病人应注意的饮食习惯\n" +
                                        "①首先要控制能量的摄入。提倡吃复合糖类、如淀粉、玉米、少吃葡萄糖、果糖及蔗糖，这类糖属于单糖，易引起血脂升高；\n" +
                                        "②限制脂肪的摄入。烹调时，选用植物油，可多吃海鱼，海鱼含有不饱和脂肪酸，能使胆固醇氧化，从而降低血浆胆固醇，还可延长血小板的凝聚，抑制血栓形成，防止中风，还含有较多的亚油酸，对增加微血管的弹性，防止血管破裂，防止高血压并发症有一定的作用；\n" +
                                        "③适量摄入蛋白质。高血压病人每日蛋白质的量为每公斤体重1g为宜。每周吃2-3次鱼类蛋白质，可改善血管弹性和通透性，增加尿钠排出，从而降低血压。如高血压合并肾功能不全时，应限制蛋白质的摄入； \n" +
                                        "④多吃含钾、钙丰富而含钠低的食品，如土豆、茄子、海带、莴笋。含钙高的食品：牛奶、酸牛奶、虾皮。少吃肉汤类，因为肉汤中含氮浸出物增加，能够促进体内尿酸增加，加重心、肝、肾脏的负担； \n" +
                                        "⑤限制盐的摄入量：每日应逐渐减至6g以下，即普通啤酒盖去掉胶垫后，一平盖食盐约为6g。这量指的是食盐量包括烹调用盐及其他食物中所含钠折合成食盐的总量。适当的减少钠盐的摄入有助于降低血压，减少体内的钠水潴留； \n" +
                                        "⑥多吃新鲜蔬菜、水果。每天吃新鲜蔬菜不少于8两，水果2至4两； \n" +
                                        "⑦适当增加海产品摄入：如海带，紫菜，海产鱼等。\n" +
                                        "3.2 运动健康管理\n" +
                                        "体力活动过少可引起中心性肥胖，胰岛素抵抗以及自主神经调节功能下降，从而导致高血压发生。\n" +
                                        "运动降低血压的原理：运动能降低交感神级张力，减少茶酚胺释放，使外周血管阻力下降；运动还能降低肾素-血管紧张素系统活性，从而使血管扩张利钠利水，降低血容量，使血压下降。\n" +
                                        "每天30分钟快走，坚持10周，可使收缩压降低10mmHg。坚持适度而有规律的体育锻炼，如慢跑、骑自行车、游泳、球类运动、健美操等以及适度的体力劳动有助于减轻体重、降低血压和提高机体免疫力。我国传统的运动和医疗保健方法，如气功和太极拳，能增进人体健康，对高血压的防治也能起到良好的作用。\n" +
                                        "应在医生的指导下进行，运动量要循序渐进，从轻度运动开始，逐渐加大运动量，但决不能勉强。任何引起体力消耗的活动均有健康效应，如散步、上楼梯、多站立等。\n" +
                                        "有氧运动对改善机体代谢功能和降低血压的作用更好。\n" +
                                        "运动还可以增加高密度脂蛋白胆固醇(HDL-C)的浓度，改善胆固醇的代谢，预防动脉粥样硬化。 \n" +
                                        "3.2.1 进行运动的注意事项\n" +
                                        "①勿过量或太强太累，要采取循序渐进的方式来增加活动量；\n" +
                                        "②注意周围环境气候。夏天：避免中午艳阳高照的时间；冬天：要注意保暖，防中风； \n" +
                                        "③穿着舒适吸汗的衣服：选棉质衣料，运动鞋等是必要的； \n" +
                                        "④选择安全场所：如公园、学校，勿在巷道、马路边； \n" +
                                        "⑤进行运动时，切勿空腹，以免发生低血糖，应在饭后2小时。 \n" +
                                        "3.2.2 运动的禁忌 \n" +
                                        "①生病或不舒服时应停止运动；\n" +
                                        "②饥饿时或饭后一小时不宜做运动；\n" +
                                        "③运动中不可立即停止，要遵守运动程序的步骤；\n" +
                                        "④运动中有任何不适现象，应即停止。\n" +
                                        "3.3 生活习惯健康管理\n" +
                                        "吸烟会导致高血压。研究证明，吸一支烟后心率每分钟增加5 -20次/分，收缩压增加10-25mmhg。这是为什么呢？因为烟叶内含有尼古丁（烟碱）会兴奋中枢神经和交感神经，使心率加快，同时也促使肾上腺释放大量儿茶酚胺，使小动脉收缩，导致血压升高。尼古丁还会刺激血管内的化学感受器，反射性地引起血压升高。长期大量吸烟还会促进大动脉粥样硬化，小动脉内膜逐渐增厚，使整个血管逐渐硬化。同时由于吸烟者血液中一氧化碳血红蛋白含量增多，从而降低了血液的含氧量，使动脉内膜缺氧，动脉壁内脂的含氧量增加，加速了动脉粥样硬化的形成。因此，无高血压的人戒烟可预防了高血压的发生，有高血压的人更应戒烟。 \n" +
                                        "与吸烟相比，饮酒对身体的利弊就存在争议。不时出现各种报告，有的说饮少量酒有益，有的说有害，但可以肯定的一点是，大量饮酒肯定有害，高浓度的酒精会导致动脉硬化，加重高血压。\n" +
                                        "3.4 心理健康管理\n" +
                                        "高血压患者的心理表现是紧张、易怒、情绪不稳，这些又都是使血压升高的诱因。由于紧张的刺激引起血中儿茶酚胺类激素升高，导致血压升高，心跳加快。患者可通过改变自己的行为方式，培养对自然环境和社会的良好适应能力，避免情绪激动及过度紧张、焦虑，遇事要冷静、沉着；当有较大的精神压力时应设法释放，向朋友、亲人倾吐或鼓励参加轻松愉快的业余活动，将精神倾注于音乐或寄情于花卉之中，使自己生活在最佳境界中，从而维持稳定的血压。\n" +
                                        "从而有高血压倾向的人应修身养性，陶冶情操，保持良好的心理状态和情绪，养成良好的生活习惯，多参加一些富有情趣的体育和文化娱乐活动，丰富自己的业余生活。\n" +
                                        "4.相关检测管理\n" +
                                        "4.1 高血压的相关检查及其意义\n" +
                                        "①心电图和超声心动图检查，以判断有无左心室肥厚和心律紊乱；\n" +
                                        "②X线及其他检查(必要时行血管造影、CT检查定位诊断)，以判断有无主动脉扩张、延长或缩窄；\n" +
                                        "③尿常规及肾功能检查，检查尿蛋白、尿糖、血肌酐、尿素氮、血钾、血尿酸水平；\n" +
                                        "④眼底检查眼底动脉硬化程度；\n" +
                                        "⑤血糖、血脂及血钙水平检查；\n" +
                                        "⑥有条件者在治疗前做24小时动态血压检测；\n" +
                                        "⑦年轻高血压患者应做肾上腺B超检查。\n" +
                                        "4.2 高血压的监测\n" +
                                        "①定期测量血压，1-2周应至少测量一次； \n" +
                                        "②治疗高血压应坚持“三心”，即信心、决心、恒心，只有这样做才能防止或推迟机体重要脏器受到损害；\n" +
                                        "③定时服用降压药，自己不随意减量或停药，可在医生指导下及现病情加予调整，防止血压反跳； \n" +
                                        "④条件允许，可自备血压计及学会自测血压；\n" +
                                        "⑤随服用适当的药物外，还要注意劳逸结合、注意饮食、适当运动、保持情绪稳定、睡眠充足； \n" +
                                        "⑥老年人降压不能操之过急，血压宜控制在140-159mmhg为宜，减少心脑血管并发症的发生； \n" +
                                        "⑦老年人及服用去甲肾上腺素能神经末梢阻断药的防止体位性低血压； \n" +
                                        "⑧不需要严格禁止性生活：注意以下几种情况，不宜进行性生活：事后不要立即进行房事、酒后应禁止性生活、若有头晕，胸闷等不适应停止性生活，并及时就医；\n" +
                                        "⑨服完药、血压升高或过低、血压波动大、出现眼花、头晕、恶心呕吐、视物不清、偏瘫、失语、意识障碍、呼吸困难、肢体乏力等即到医院就医。如病情危重，请求救120急救中心。\n" +
                                        "糖尿病健康管理\n" +
                                        "1.糖尿病饮食原则\n" +
                                        "①减轻胰岛负担，使血糖、血脂达到或接近正常值，并防止或延缓心血管等并发症的发生与发展。\n" +
                                        "②维持健康，使成人能从事各种正常的活动，儿童能正常地生长发育。\n" +
                                        "③维持正常的体重。肥胖者减少能摄入，可以改善受体对胰岛素的敏感性。消瘦者双可使体重增加，以增强对种传染的抵抗力。\n" +
                                        "2.糖尿病患者饮食宜忌\n" +
                                        "2.1 糖尿病患者吃什么好\n" +
                                        "①谷类：包括米、面等主食。粗杂粮如莜麦面、荞麦面、燕麦片、玉米面、三合面(玉米、黄豆、白面按2：2：1比例做成)，含有多量维生素B和食物纤维。实验证明，它们有延缓血糖升高的作用。\n" +
                                        "②大豆及其制品：除富含蛋白质、无机盐和维生素外，豆油中还有较多的ｗ-3多不饱和脂肪酸，既能降低血胆固醇，又能降低血清甘油三酯，所含的谷丙醇也有降脂作用。但如果已发生糖尿病肾病，则不宜再食豆制品。\n" +
                                        "③畜禽鱼类：均含丰富的蛋白质，一般在20%左右，含碳水化合物极少。白色的瘦肉如禽肉和鱼肉含饱和脂肪酸较少，且鱼油特别是深海鱼油含较多的不饱和脂肪酸，对糖尿病有利，红色的瘦肉如畜肉含较多的饱和脂肪酸，应少吃。\n" +
                                        "④乳类：牛奶等乳类制品营养丰富，所含的碳水化合物主要为乳糖，是由一分子的葡萄糖和一分子的半乳糖组成，这两个单糖在肠道吸收均很快。成年后，肠道内的乳糖酶明显减少，多相对缺乏，故分解慢，对血糖影响较小。牛奶中所含蛋白质的量亦较高，且为优质蛋白质，并含有丰富的维生素、微量元素及钙，均有利于糖尿病，所以糖尿病患者可以适量饮用，一般每天以250-500ml为宜。但其中所含脂肪比例较高，故有高脂血症者可改服脱脂牛奶。\n" +
                                        "⑤蛋类：主要含优质蛋白质，一般为13%，含碳水化合物很少，多在3%以下，故适合糖尿病患者食用，但其蛋黄中脂肪特别是胆固醇含量很高，故高脂血症者应只吃蛋白不吃蛋黄。\n" +
                                        "⑥油脂类：烹调油是富含脂肪的食物，应按定量食用，尽量用植物油代替动物油。为减少饱和脂肪酸的摄入，多用含不饱和脂肪酸较多的豆油、玉米油等。\n" +
                                        "⑦蔬菜类：蔬菜一般含热量很低，大多在3%以下，主要提供维生素、矿物质、微量元素和食物纤维等。花叶类蔬菜含蛋白质、脂肪和碳水化合物均很少，糖尿病患者可任意选用，有时可以作为充餐食物和加餐食品。海洋植物含有较多的碘及可溶性纤维，对身体有利。瓜类与花叶类接近，特别是苦瓜、南瓜等对糖尿病有一定益处。但根茎类则含有大量碳水化合物，如马铃薯等，应作为主食看待。\n" +
                                        "⑧水果类：水果含有丰富的维生素C、矿物质、水分、纤维素和果糖，味道鲜美，色彩夺人，能激发食欲，对糖尿病患者有益。尤其是果胶，有延缓葡萄糖吸收的作用。水果所含的葡萄糖、果糖和蔗糖等约为6%-20%，所含葡萄糖对糖尿病不利，但果糖则影响较小，其对血糖的影响与其他含多糖类食物类似，故国外的糖尿病专家主张对水果不予限制，但应计入每天的总热量。传统认为，水果可以吃，但应适量。病情控制较好，空腹血糖≤6.89mmol／L(140mg／d1)者，可以适当进食水果。吃水果的时间应在两餐之间，此时血糖较低，吃一点含糖的水果，血糖不会明显升高，餐后吃水果就等于加餐了，血糖会高起来。在选择水果时，应选择含糖量最低的水果，如苹果、 鸭梨、橘子、橙子、李子、草莓、菠萝等。香蕉、干果中的栗子、白果等主要成分是淀粉，食用量应计入主食量。一般而言，每天吃200g水果就要相应减少 25g的粮食。\n" +
                                        "⑨甜味剂\n" +
                                        "a．蔗糖：在血糖控制较好时可以适当进食，但应控制在总热量的5%以下，而且应与其他食物一起混合进食。\n" +
                                        "b．果糖：比起蔗糖和大多数淀粉，进食果糖对血糖的影响较小，因此用果糖作为甜味剂是有好处的。但多食果糖可能会引起血清胆固醇和低密度脂蛋白胆固醇的升高，因此有高血脂症的患者最好少吃。\n" +
                                        "c．木糖醇、山梨醇等糖醇：是具有甜味的碳水化合物，吸收率低，一般为葡萄糖的六分之一左右，故食后不容易引起血糖增高，而且产热量少，1g仅产热量不到 8.36kJ，肠道吸收不完全，因此可以用作甜味剂，但应计入总热量。每天最多不要超过50g，以防因吸收不完全引起渗透性腹泻。\n" +
                                        "d．不含热量和营养素的甜味剂：如糖精、蛋白糖、甜叶菊片等，均具有很高的甜度，代谢时不需胰岛素，不会引起血糖升高。糖精的甜度是蔗糖的300-500倍，但大量摄入糖精有诱发膀胱癌的作用，不宜多用。而且因其可通过胎盘，孕妇不宜食用。蛋白糖即天冬氨酸苯丙氨酸甲酯，其甜度为蔗糖的200倍，甜味纯正，直至目前未见明显副作用，为较理想的甜味剂。甜叶菊片是从甜叶菊中提取，甜度与糖精相似，应用较广。\n" +
                                        "2.2糖尿病患者吃什么不好？\n" +
                                        "①易使血糖迅速升高的食物\n" +
                                        "白糖、红糖、冰糖、葡萄糖、麦芽糖、蜂蜜、奶糖、蜜饯、水果糖、巧克力、水果罐头、甜饮料、甜饼干、甜面包、果汁、果酱、汽水、蛋糕及糖制糕点等。\n" +
                                        "②易使血脂升高的食物\n" +
                                        "牛油、羊油、猪油、黄油、奶油、肥肉、猪皮、鸭皮、猪肠等。对富有胆固醣的食物应特别注意，应该不用或少用，以防止动脉硬化性心脏病的发生，如动物内脏(肝、脑、肾、心)、蟹黄、鱼卵、虾卵、蛋黄等。\n" +
                                        "2.3糖尿病患者宜少吃的食品\n" +
                                        "①太咸的食品：如腌制品酱菜等。\n" +
                                        "②含油多、热量较高的坚果类：花生、瓜子、腰果、松子、核桃、杏仁、开心果等。\n" +
                                        "③油腻食物：如油炸、油酥食品。\n" +
                                        "3.糖尿病患者食疗方法\n" +
                                        "3.1药粥\n" +
                                        "适合糖尿病患者食用的药粥有：\n" +
                                        "豆腐浆粥（《本草纲目拾遗》）：粳米50g，豆腐浆500mL，食盐或白糖少许，先煮粳米，后加豆腐浆，至米开花粥稠，分早晚2次服用。适用于糖尿病伴高血压、冠心病者，若糖尿病肾病肾衰者不宜服用。\n" +
                                        "绿豆粥（《普济方》）：粳米50g，绿豆50g，共煮粥食用。绿豆有降血脂作用，适用于糖尿病伴高血压、冠心病者，若糖尿病肾病肾衰者不宜服用。\n" +
                                        "赤小豆鱼粥（经验方）：赤小豆50g，鲤鱼1尾，先煮鱼取汁，后加赤小豆煮烂。适用于糖尿病水肿者。\n" +
                                        "菠菜粥（《本草纲目》）：菠菜100～150g，粳米50g，煮粥食用。适用于糖尿病阴虚化热型。便溏腹泻者禁服。\n" +
                                        "芹菜粥（《本草纲目》）：新鲜芹菜60～100g切碎，粳米100g，煮粥服用。适用于糖尿病合并高血压者。\n" +
                                        "木耳粥（《鬼遗方》）：银耳5～10g（或黑木耳30g），粳米100g，大枣3枚。先浸泡银耳，将粳米、大枣煮熟后加银耳，煮粥食。适用于糖尿病血管 病变者，美国明尼索达大学医学院汉穆希密特教授认为，常食木耳可以减少和预防心脏病的发作。木耳有破血作用，糖尿病孕妇慎用。\n" +
                                        "萝卜粥（《图经本草》）：新鲜白萝卜适量，粳米50g，煮粥服用。适用于糖尿病痰气互结者。\n" +
                                        "山药粥（《医学衷中参西录》）：生山药60g，大米60g，先煮米为粥，山药为糊，酥油蜜炒合凝，用匙揉碎，放入粥内食用。适用于糖尿病脾肾气虚、腰酸乏力、便泄者。\n" +
                                        "胡萝卜粥（《本草纲目》）：新鲜胡萝卜50g、粳米100g，煮粥服用，适用于糖尿病合并高血压者。药理研究：胡萝卜中琥珀酸钾盐有降压作用。\n" +
                                        "冬瓜鸭粥（验方）：冬瓜一个，光鸭一只，大米200g，香菇10个，陈皮3g。先将鸭于油锅煎爆至香，用葱、姜调味，入粥煮烂捞起切片。食鸭服粥。适用于糖尿病合并高血压者。\n" +
                                        "槐花粥（验方）：干槐花30g或鲜品50g，大米50g，煮粥服用。适用于糖尿病合并高血压、中风患者。槐花可扩张冠状动脉，可防治动脉硬化，常服用有预防中风作用。\n" +
                                        "菊花粥（《老老恒言》）：秋菊烘干研末，先以粳米100g煮粥。调入菊花末10g稍煮一二沸即可服用。适用于糖尿病视物昏花者。菊花清肝明目，临床用于防治高血压、冠心病、高脂血症。\n" +
                                        "玉米粉粥（《食物疗法》）：粳米50-100g，加水煮至米开花后，调入玉米粉30g（新鲜玉米粉），稍煮片刻服用。适用于各种糖尿病人。玉米含蛋白质、脂肪、糖类、维生素和矿物质，玉米油是一种富含多个不饱和脂肪酸的油脂，是一种胆固醇吸收抑制剂。\n" +
                                        "荔枝粥（《泉州本草》）：荔枝5-7个，粳米50g，水适量煮粥服用。适用于Ⅱ型糖尿病者。\n" +
                                        "葛根粉粥（《太平圣惠方》）：葛根粉30g，粳米50g，共煮粥服用。适用于老年人糖尿病，或伴有高血压、冠心病者，葛根含黄酮类，具有解热、降血脂、降低血糖作用。\n" +
                                        "生地黄粥（《月瞿仙神隐》）：鲜生地150g洗净捣烂取汁，先煮粳米50g为粥，再加入生地汁，稍煮服用。适用于气阴两虚型糖尿病者。\n" +
                                        "杞子粥（《本草纲目》）：枸杞子15-20g，糯米50g，煮粥服用。适用于糖尿病肝肾阴虚者。\n" +
                                        "葫芦粥（经验方）：陈葫芦10g，粳米50g煮粥服用，适用于糖尿病水肿者。\n" +
                                        "天花粉粥（《千金方》）：花粉30g，温水浸泡2小时，加水200mL，煎至100mL，入粳米50g煮粥服用。适用糖尿病口渴明显者，糖尿病孕妇禁用。\n" +
                                        "韭子粥（《千金翼方》）：韭子10g炒熟，粳米50g，煮粥服用，适用于糖尿病性阳痿病人。\n" +
                                        "3.2菜肴与药膳\n" +
                                        "适合糖尿病患者食用的菜肴与药膳有：\n" +
                                        "苦瓜：清热解毒，除烦止渴，动物实验表明苦瓜有明显降低血糖作用。糖尿病人常食苦瓜有一定降低血糖作用，可用鲜苦瓜作菜食用或红烧苦瓜，每次100g。糖尿病脾胃虚寒者不宜服用。\n" +
                                        "蚌肉苦瓜汤：苦瓜250g，蚌肉100g，共煮汤，加油盐调味，熟后喝汤吃苦瓜蚌肉。适用于轻型糖尿病。\n" +
                                        "南瓜：具有降低血糖、血脂作用。国内外临床研究表明，南瓜粉对轻型糖尿病确有疗效。可将南瓜烘干研粉，每次5g，每日3次，也可用鲜南瓜250g煮熟食用，既充饥又可降低血糖。\n" +
                                        "洋葱（葱头）：味淡性平，具有降低血糖作用，也用洋葱50-100g水煎服，也可作菜食用。\n" +
                                        "玉米须煲瘦猪肉：玉米须30g，瘦猪肉100g，煮熟饮汤食肉，适用于一般糖尿病患者。\n" +
                                        "枸杞子蒸鸡：枸杞子15g，母鸡1只加料酒、姜、葱、调料，共煮熟食枸杞子、鸡肉，饮汤。适用于糖尿病肾气虚弱者。\n" +
                                        "苦瓜焖鸡翅：苦瓜250g，鸡翅膀1对，姜汁、黄酒、调料、植物油适量，先炒鸡翅膀，后入苦瓜、调料，熟后食肉饮汤。\n" +
                                        "沙参玉竹煲老鸭：沙参30～50g，玉竹30g，老雄鸭一只，葱、姜、盐少许焖煮熟后食肉，饮汤。适用于中老年糖尿病。\n" +
                                        "清蒸茶鲫鱼：鲫鱼500g，绿茶20g左右，蒸熟，淡食鱼肉。适用于糖尿病。\n" +
                                        "萝卜煲鲍鱼：干鲍鱼20g，鲜萝卜250g，加水煲熟，食肉饮汤。适用于一般糖尿病患者。\n" +
                                        "黄鳝：具有一定降糖作用。用黄鳝制做的药膳有：参蒸鳝段，内金鳝鱼，烩鳝鱼丝，归参鱼鳝，翠皮爆鳝丝等均可选用。\n" +
                                        "清炖甲鱼：活甲鱼500g，葱、姜、笋片、酒适量，炖熟饮汤。适用于老年糖尿病肾阴不足患者。\n" +
                                        "韭菜煮蛤蜊肉：韭菜250g，蛤蜊肉250g，料酒、姜、盐少许，煮熟饮汤食肉，适用于糖尿病肾阴不足者。\n" +
                                        "玉米须炖龟：玉米须100g，乌龟1只，葱、盐、料酒适量，炖熟食肉饮汤。适用于一般糖尿病患者。\n" +
                                        "玉米须炖蚌肉：玉米须100g，蚌肉150g，盐、葱、料酒适量。炖熟食饮汤，适用于一般糖尿病患者。\n" +
                                        "田螺：具有一定降血糖作用，大田螺10至20个，盐、姜、葱少许，煮熟食螺饮汤。\n" +
                                        "鳕鱼：鳕鱼胰腺含有丰富的胰岛素，可炖食。适用于各型糖尿病患者。\n" +
                                        "蚕蛹：洗净后用植物油炒，或煎成汤剂。适用于各型糖尿病患者。\n" +
                                        "海参：洗净炒食可用于各型糖尿病。\n" +
                                        "鲜蘑炒豌豆：鲜口蘑100g，鲜嫩豌豆150g，植物油、盐少许。适用于各型糖尿病人。\n" +
                                        "其他菜类：素炒豌豆、素炒豆芽菜、素炒冬瓜、素炒菠菜、炒绿豆芽、香干丝炒芹菜、冬菇烧白菜等均适宜糖尿病食用。\n" +
                                        "3.3汤类、饮料\n" +
                                        "糖尿病患者宜于饮用的汤类、饮料有：\n" +
                                        "冬瓜瓤汤（《圣惠方》）：冬瓜瓤（干品）30g水煎代茶饮。\n" +
                                        "葫芦汤：鲜葫芦60g，或干品30g，水煎饮汤。适用于糖尿病皮肤疖肿。\n" +
                                        "赤小豆冬瓜汤：赤小豆、冬瓜适量煎汤。适用于糖尿病皮肤疖肿。\n" +
                                        "糯米桑皮汤：爆糯米花30g，桑白皮30g，水煎服。适用于糖尿病口渴多饮者。\n" +
                                        "菠菜银耳汤：鲜菠菜根150～200g，银耳20g，饮汤食银耳，适用于糖尿病大便秘结者。\n" +
                                        "兔肉汤：兔1只，盐调料，煮熟食肉饮汤。\n" +
                                        "鸽肉银耳汤：白鸽半只，银耳15g，煮熟食肉饮汤。适用于各型糖尿病。\n" +
                                        "鸽肉山药玉竹汤：白鸽1只，山药30g，玉竹20g，共煮熟食肉饮汤。适用于阴虚型糖尿病。\n" +
                                        "猪胰汤：猪胰一个，黄芪60g，山药120g，水煎汤，食猪胰，饮汤。猪胰子焙干研末，每次6～9g，每日3次。适用于各型糖尿病。\n" +
                                        "双耳汤：白木耳、黑木耳各10g，冰糖少许，白木耳、黑木耳洗净加清水蒸至木耳熟烂，食木耳饮汤。适用于糖尿病人眼底出血症。\n" +
                                        "菊槐绿茶饮：菊花、槐花、绿茶各3g，沸水冲泡饮用。适用于糖尿病伴高血压患者。\n" +
                                        "苦瓜茶饮：鲜苦瓜一个，绿茶适量，温水冲泡。适用于轻型糖尿病。\n" +
                                        "消渴茶（《外台秘要》）：麦冬、玉竹各15g，黄芪、通草各100g，茯苓、干姜、葛根、桑白皮各50g，牛蒡根150g，干生地、枸杞根、银花藤、薏苡仁各30g，菝葜24g，共研末制成药饼，每个15g，每取一个放火上令香熟勿焦，研末代茶饮。\n" +
                                        "地骨皮露（《全国中药成药处方集》）：地骨皮300g，为细末，用蒸馏方法，成露1500g，每服60g，一日2次。\n" +
                                        "消渴速溶饮：鲜冬瓜皮和西瓜皮各1000g，白糖适量，瓜蒌根250g。瓜皮切薄片，瓜蒌根捣碎水泡，放锅内水适量煮1小时，捞去渣再以小火继续加煎煮 浓缩，至稠粘停火，待温，加白糖粉，把煎液吸净、拌匀、晒干、压碎，每次10g，以沸水冲化，频饮代茶。适用于各型糖尿病。\n" +
                                        "白萝卜汁（《食医心镜》）：白萝卜1000g，洗净捣烂，纱布包绞汁，每次50mL，每日3次。\n" +
                                        "鲜李汁（《泉州本草》）：鲜熟李子适量，切碎绞汁，每次1汤匙，一日3次。\n" +
                                        "乌梅茶：乌梅15g，沸水冲泡代茶饮。\n" +
                                        "黄精枸杞茶：黄精15g，枸杞10g，绿茶3g，温开水冲泡代茶饮。\n" +
                                        "鲜生地露（《消渴病中医防治》）：鲜生地500g，切成小块，制露1000g，每服100g，具有滋肾养阴，生津止渴作用。\n" +
                                        "麦冬茶（《消渴病中医防治》）：麦冬、党参、北沙参、玉竹、花粉各9g，乌梅、知母、甘草各6g，共为细末，每服1剂，白开水冲，代茶饮。");
                            }else {
                                entity.setHelthManage("健康管理");
                                entity.setHelthManageContent("1.饮食健康管理\n" +
                                        "第一是全面平衡，即样样都吃，不挑食，不偏食。众所周知，任何一种单一的天然食物都不能提供人体所需要的全部营养素。因此，合理膳食必须由多种食物组成，才能达到平衡膳食之目的。保持以植物性食物为主，动物性食物为辅，热能来源以粮食为主的特点，避免西方国家膳食模式所带来的脂肪过多和热能太高的弊端。\n" +
                                        "第二是适量。太胖或太瘦都不利于健康。既往养生经验提出 “食不过饱”的主张，其目的就是要使适度，饥饱适当，热能和蛋白质等营养素摄入与消耗相适应，避免过胖或消瘦。\n" +
                                        "第三是三餐要合理。要建立合理的饮食制度，如何合理膳食？切忌暴饮暴食，提倡不吃或少吃零食。一日三餐中每餐的热能分配以早餐占全天总热能的30%，午餐占40%，晚餐占30%较为合适。 \n" +
                                        "第四是夜点心不能吃得太油、太饱。特别是吃了大量肥肉、排骨、肥鸡、肥鸭等高蛋白、高脂肪饮食，尤其是吃完夜点心忙着上床睡觉，促使人体内胰腺外分泌过于活跃，胰液外溢；同时，暴饮暴食后会使胃、十二指肠粘膜充血和十二指肠乳头水肿，导致胰腺自身消化，引起急性出血性环死性。\n" +
                                        "2.运动健康管理\n" +
                                        "每天30分钟快走。坚持适度而有规律的体育锻炼，如慢跑、骑自行车、游泳、球类运动、健美操等以及适度的体力劳动有助于减轻体重、提高机体免疫力。我国传统的运动和医疗保健方法，如气功和太极拳，能增进人体健康。\n" +
                                        "2.1 进行运动的注意事项： \n" +
                                        "① 勿过量或太强太累，要采取循序渐进的方式来增加活动量； \n" +
                                        "② 注意周围环境气候：夏天：避免中午艳阳高照的时间；冬天：要注意保暖，防中风；\n" +
                                        "③ 穿着舒适吸汗的衣服：选棉质衣料，运动鞋等是必要的； \n" +
                                        "④ 选择安全场所：如公园、学校，勿在巷道、马路边； \n" +
                                        "⑤ 进行运动时，切勿空腹，以免发生低血糖，应在饭后2小时。 \n" +
                                        "2.2 运动的禁忌 \n" +
                                        "① 生病或不舒服时应停止运动 ；\n" +
                                        "② 饥饿时或饭后一小时不宜做运动 ；\n" +
                                        "③ 运动中不可立即停止，要遵守运动程序的步骤； \n" +
                                        "④ 运动中有任何不适现象，应即停止 。\n" +
                                        "3.生活习惯健康管理\n" +
                                        "不吸烟：吸烟不仅浪费金钱，影响环境，危害安全，而且与高血压、慢性支气管炎、冠心病、癌症等多种疾病有直接关系，严重危害健康。吸烟是人类严重的不健康行为。\n" +
                                        "不饮酒：长期大量饮酒会损害人体的肝脏、肾脏、神经和心血管系统，酒后驾驶是对自己和他人的生命不负责任的行为。\n" +
                                        "不吸毒：毒品（海洛因、大麻、冰毒、摇头丸等）麻醉人的神经，危害极大，所有的人都应该远离毒品。切不可与别人共用针头注射毒品，否则极易传染艾滋病和肝炎等疾病。\n" +
                                        "保持有规律生活节奏：无规律的生活习惯会扰乱人体的生命节律，降低人体的免疫力，使疾病发生率增高，对健康极为不利。因此应该起居定时、按时作息、保证充足的睡眠。睡前不喝茶或咖啡，进食不过饱。心情平静，避免焦虑或激动，不做剧烈运动。\n" +
                                        "工作有张有弛，不过度紧张和长期劳累。\n" +
                                        "娱乐有度，不放纵，如不看通宵电影，不打通宵麻将，听音乐 音量不过大。\n" +
                                        "不喝生水或不清洁的水；不吃不洁或腐败变质的食物。");
                            }
                            reportList.add(entity);
                        }

                    }
                }
                for(ReportEntity entity : reportList){
                    CreateWordReportImpl createWordReport = new CreateWordReportImpl();
                    createWordReport.createReport(entity);
                }
                JOptionPane.showMessageDialog(this, "成功生成报告", "标题",JOptionPane.WARNING_MESSAGE);
            } catch (Exception e1) {
                JOptionPane.showMessageDialog(this, "生成报告错误", "标题",JOptionPane.WARNING_MESSAGE);
                e1.printStackTrace();
            }
        }
    }

    private void setRiskAndLevelWomen(String p53Type,String apoeType,ReportEntity entity){
        String sicks = entity.getSicks();
        setLungRiskAndLevelWomen(p53Type,apoeType,entity);
        setLiverRiskAndLevelWomen(p53Type,apoeType,entity);
        setColoRiskAndLevelWomen(p53Type,apoeType,entity);
        setOvarianRiskAndLevelWomen(p53Type,apoeType,entity);
        setEndomRiskAndLevelWomen(p53Type,apoeType,entity);

        setBreastRiskAndLevelWomen(p53Type,apoeType,entity);
        setFemoraRiskAndLevelWomen(p53Type,apoeType,entity);
        setLscheRiskAndLevelWomen(p53Type,apoeType,entity);
        setCataRiskAndLevelWomen(p53Type,apoeType,entity);
    }
    private void setCataRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(apoeType)){
            entity.setCataRisk("1.0000");
            entity.setCataLevel("正常");
        }else if("杂合突变".equals(apoeType)){
            entity.setCataRisk("1.3653");
            entity.setCataLevel("一般");
        }else if("纯合突变".equals(apoeType)){
            entity.setCataRisk("1.5170");
            entity.setCataLevel("关注");
        }

    }
    private void setLscheRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks();
        if("正常".equals(apoeType)){
            double sum = 1.0000;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }else if("杂合突变".equals(apoeType)){
            double sum = 1.7010;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }else if("纯合突变".equals(apoeType)){
            double sum = 1.8900;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }

    }
    private void setFemoraRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(apoeType)){
            entity.setFemoralRisk("1.0000");
            entity.setFemoralLevel("正常");
        }else if("杂合突变".equals(apoeType)){
            entity.setFemoralRisk("1.5480");
            entity.setFemoralLevel("关注");
        }else if("纯合突变".equals(apoeType)){
            entity.setFemoralRisk("1.7200");
            entity.setFemoralLevel("关注");
        }

    }
    private void setBreastRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(apoeType)){
            entity.setBreastRisk("1.0000");
            entity.setBreastLevel("正常");
        }else if("杂合突变".equals(apoeType)){
            entity.setBreastRisk("1.7811");
            entity.setBreastLevel("关注");
        }else if("纯合突变".equals(apoeType)){
            entity.setBreastRisk("1.9790");
            entity.setBreastLevel("关注");
        }
    }

    private void setEndomRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(p53Type)){
            entity.setEndomRisk("1.0000");
            entity.setEndomLevel("正常");
        }else if("杂合突变".equals(p53Type)){
            entity.setEndomRisk("1.0692");
            entity.setEndomLevel("一般");
        }else if("纯合突变".equals(p53Type)){
            entity.setEndomRisk("1.0800");
            entity.setEndomLevel("一般");
        }
    }
    private void setOvarianRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(p53Type)){
            entity.setOvarianRisk("1.0000");
            entity.setOvarianLevel("正常");
        }else if("杂合突变".equals(p53Type)){
            entity.setOvarianRisk("1.0395");
            entity.setOvarianLevel("一般");
        }else if("纯合突变".equals(p53Type)){
            entity.setOvarianRisk("1.0500");
            entity.setOvarianLevel("一般");
        }

    }
    private void setColoRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks();
        if("正常".equals(p53Type)){
            double sum = 1.0000;
            if(sicks.contains("吸烟")){
                sum +=1.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=1.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2305;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);

        }else if("杂合突变".equals(p53Type)){
            double sum = 1.0791;
            if(sicks.contains("吸烟")){
                sum +=1.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=1.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2305;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);

        }else if("纯合突变".equals(p53Type)){
            double sum = 1.0900;
            if(sicks.contains("吸烟")){
                sum +=1.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=1.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2305;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);
        }

    }
    private void setLiverRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks();
        if("正常".equals(p53Type)){
            double sum = 1.0000;
            if(sicks.contains("吸烟")){
                sum +=0.2920;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1930;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLiverRisk(dFormat.format(sum));
            entity.setLiverLevel(level);
        }else if("杂合突变".equals(p53Type)){
            double sum = 1.1880;
            if(sicks.contains("吸烟")){
                sum +=0.2920;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1930;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLiverRisk(dFormat.format(sum));
            entity.setLiverLevel(level);
        }else if("纯合突变".equals(p53Type)){
            double sum = 1.3200;
            if(sicks.contains("吸烟")){
                sum +=0.2920;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1930;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLiverRisk(dFormat.format(sum));
            entity.setLiverLevel(level);
        }
    }
    private void setLungRiskAndLevelWomen(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks();
        if("正常".equals(p53Type)){
            double sum = 1.0000;
            if(sicks.contains("吸烟")){
                sum += 0.4970;
            }
            if(sicks.contains("高血压")){
                sum += 0.1582;
            }
            if(sicks.contains("肺结核")){
                sum += 0.1098;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLungRisk(dFormat.format(sum));
            entity.setLungLevel(level);
        }else if("杂合突变".equals(p53Type)){
            double sum = 1.0899;
            if(sicks.contains("吸烟")){
                sum += 0.4970;
            }
            if(sicks.contains("高血压")){
                sum += 0.1582;
            }
            if(sicks.contains("肺结核")){
                sum += 0.1098;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLungRisk(dFormat.format(sum));
            entity.setLungLevel(level);
        }else if("纯合突变".equals(p53Type)){
            double sum = 1.2110;
            if(sicks.contains("吸烟")){
                sum += 0.4970;
            }
            if(sicks.contains("高血压")){
                sum += 0.1582;
            }
            if(sicks.contains("肺结核")){
                sum += 0.1098;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLungRisk(dFormat.format(sum));
            entity.setLungLevel(level);
        }
    }

    private void setRiskAndLevel(String p53Type,String apoeType,ReportEntity entity) {
        setLungRiskAndLevel(p53Type,apoeType,entity);
        setLiverRiskAndLevel(p53Type,apoeType,entity);
        setColoRiskAndLevel(p53Type,apoeType,entity);
        setProsRiskAndLevel(p53Type,apoeType,entity);
        setHyperRiskAndLevel(p53Type,apoeType,entity);

        setAlzhRiskAndLevel(p53Type,apoeType,entity);
        setLscheRiskAndLevel(p53Type,apoeType,entity);
        setCereRiskAndLevel(p53Type,apoeType,entity);
        setInfaRiskAndLevel(p53Type,apoeType,entity);
    }

    private void setInfaRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(apoeType)){
            entity.setInfaRisk("1.0000");
            entity.setInfaLevel("正常");
        }else if("杂合突变".equals(apoeType)){
            entity.setInfaRisk("2.2500");
            entity.setInfaLevel("特别关注");
        }else if("纯合突变".equals(apoeType)){
            entity.setInfaRisk("2.5000");
            entity.setInfaLevel("特别关注");
        }
    }
    private void setCereRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        if("正常".equals(apoeType)){
            entity.setCereRisk("1.0000");
            entity.setCereLevel("正常");
        }else if("杂合突变".equals(apoeType)){
            entity.setCereRisk("1.5678");
            entity.setCereLevel("关注");
        }else if("纯合突变".equals(apoeType)){
            entity.setCereRisk("1.8600");
            entity.setCereLevel("关注");
        }
    }
    private void setLscheRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(apoeType)){
            double sum = 1.0000;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }else if("杂合突变".equals(apoeType)){
            double sum = 1.7010;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }else if("纯合突变".equals(apoeType)){
            double sum = 1.8900;
            if(sicks.contains("高血压")){
                sum +=0.4003;
            }
            if(sicks.contains("糖尿病")){
                sum +=0.4678;
            }
            if(sicks.contains("冠心病")){
                sum +=0.2887;
            }
            if(sicks.contains("肥胖")){
                sum +=0.1960;
            }
            if(sicks.contains("吸烟")){
                sum +=0.1010;
            }
            if(sicks.contains("饮酒")){
                sum +=0.4652;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setLscheRisk(dFormat.format(sum));
            entity.setLscheLevel(level);
        }
    }
    private void setAlzhRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(apoeType)){
            double sum = 1.0000;
            if(sicks.contains("糖尿病")){
                sum += 0.1300;
            }
            if(sicks.contains("阿尔兹海默家族史")){
                sum += 0.2620;
            }
            if(sicks.contains("脑外伤")){
                sum += 0.1580;
            }
            if(sicks.contains("抑郁")){
                sum += 0.2130;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setAlzhRisk(dFormat.format(sum));
            entity.setAlzhLevel(level);
        }else if("杂合突变".equals(apoeType)){
            double sum = 1.9629;
            if(sicks.contains("糖尿病")){
                sum += 0.1300;
            }
            if(sicks.contains("阿尔兹海默家族史")){
                sum += 0.2620;
            }
            if(sicks.contains("脑外伤")){
                sum += 0.1580;
            }
            if(sicks.contains("抑郁")){
                sum += 0.2130;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setAlzhRisk(dFormat.format(sum));
            entity.setAlzhLevel(level);
        }else if("纯合突变".equals(apoeType)){
            double sum = 2.1810;
            if(sicks.contains("糖尿病")){
                sum += 0.1300;
            }
            if(sicks.contains("阿尔兹海默家族史")){
                sum += 0.2620;
            }
            if(sicks.contains("脑外伤")){
                sum += 0.1580;
            }
            if(sicks.contains("抑郁")){
                sum += 0.2130;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setAlzhRisk(dFormat.format(sum));
            entity.setAlzhLevel(level);
        }
    }

    private void setHyperRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(p53Type)){
            if(sicks.contains("肥胖")){
                entity.setHyperRisk("1.2300");
                entity.setHypeLevel("一般");
            }else{
                entity.setHyperRisk("1.0000");
                entity.setHypeLevel("正常");
            }
        }else if("纯合突变".equals(p53Type)){
            if(sicks.contains("肥胖")){
                entity.setHyperRisk("1.8000");
                entity.setHypeLevel("关注");
            }else{
                entity.setHyperRisk("1.5700");
                entity.setHypeLevel("关注");
            }
        }else if("杂合突变".equals(p53Type)){
            if(sicks.contains("肥胖")){
                entity.setHyperRisk("1.6430");
                entity.setHypeLevel("关注");
            }else{
                entity.setHyperRisk("1.4130");
                entity.setHypeLevel("一般");
            }
        }
    }
    private void setProsRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.5450");
                entity.setProsLevel("关注");
            }else if(sicks.contains("饮酒")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.3740");
                entity.setProsLevel("一般");
            }else if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.4290");
                entity.setProsLevel("一般");
            }else if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.2870");
                entity.setProsLevel("一般");
            }else if(sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.2580");
                entity.setProsLevel("一般");
            }else if(sicks.contains("饮酒")){
                entity.setProsRisk("1.1160");
                entity.setProsLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setProsRisk("1.1710");
                entity.setProsLevel("一般");
            }else{
                entity.setProsRisk("1.0000");
                entity.setProsLevel("正常");
            }
        }else if("纯合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.8650");
                entity.setProsLevel("关注");
            }else if(sicks.contains("饮酒")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.6940");
                entity.setProsLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.7490");
                entity.setProsLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.6070");
                entity.setProsLevel("关注");
            }else if(sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.5780");
                entity.setProsLevel("关注");
            }else if(sicks.contains("饮酒")){
                entity.setProsRisk("1.4360");
                entity.setProsLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setProsRisk("1.4910");
                entity.setProsLevel("一般");
            }else{
                entity.setProsRisk("1.3200");
                entity.setProsLevel("一般");
            }
        }else if("杂合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.7330");
                entity.setProsLevel("关注");
            }else if(sicks.contains("饮酒")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.5620");
                entity.setProsLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.6170");
                entity.setProsLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setProsRisk("1.4750");
                entity.setProsLevel("一般");
            }else if(sicks.contains("前列腺癌家族史")){
                entity.setProsRisk("1.4460");
                entity.setProsLevel("一般");
            }else if(sicks.contains("饮酒")){
                entity.setProsRisk("1.3040");
                entity.setProsLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setProsRisk("1.3590");
                entity.setProsLevel("一般");
            }else{
                entity.setProsRisk("1.1880");
                entity.setProsLevel("一般");
            }
        }
    }
    private void setColoRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(p53Type)){
            double sum = 1.0000;
            if(sicks.contains("吸烟")){
                sum +=0.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2365;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);
        }else if("杂合突变".equals(p53Type)){
            double sum = 1.0791;
            if(sicks.contains("吸烟")){
                sum +=0.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2305;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);
        }else if("纯合突变".equals(p53Type)){
            double sum = 1.0900;
            if(sicks.contains("吸烟")){
                sum +=0.1264;
            }
            if(sicks.contains("饮酒")){
                sum +=0.1208;
            }
            if(sicks.contains("结直肠癌")){
                sum +=0.2517;
            }
            if(sicks.contains("便秘")){
                sum +=0.2063;
            }
            if(sicks.contains("便血")){
                sum +=1.2305;
            }
            String level = "";
            level = getRiskLevel(sum, level);
            DecimalFormat dFormat=new DecimalFormat("#.0000");
            entity.setColoRisk(dFormat.format(sum));
            entity.setColoLevel(level);
        }
    }

    private String getRiskLevel(double sum, String level) {
        if(sum == 1.0000){
            level = "正常";
        }else if(sum>1.0000&&sum<=1.5000){
            level = "一般";
        }else if(sum>1.5000&&sum<=2.0000){
            level = "关注";
        }else if(sum>2.0000&&sum<=2.5000){
            level = "特别关注";
        }else if(sum>2.5000){
            level = "重视";
        }
        return level;
    }

    private void setLiverRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setLiverRisk("1.4850");
                entity.setLiverLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setLiverRisk("1.2920");
                entity.setLiverLevel("一般");
            }else if(sicks.contains("饮酒")){
                entity.setLiverRisk("1.1930");
                entity.setLiverLevel("一般");
            }else {
                entity.setLiverRisk("1.0000");
                entity.setLiverLevel("正常");
            }
        }else if("纯合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setLiverRisk("1.8080");
                entity.setLiverLevel("关注");
            }else if(sicks.contains("吸烟")){
                entity.setLiverRisk("1.6120");
                entity.setLiverLevel("关注");
            }else if(sicks.contains("饮酒")){
                entity.setLiverRisk("1.5130");
                entity.setLiverLevel("关注");
            }else {
                entity.setLiverRisk("1.3200");
                entity.setLiverLevel("一般");
            }
        }else if("杂合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("饮酒")){
                entity.setLiverRisk("1.6730");
                entity.setLiverLevel("关注");
            }else if(sicks.contains("吸烟")){
                entity.setLiverRisk("1.4800");
                entity.setLiverLevel("一般");
            }else if(sicks.contains("饮酒")){
                entity.setLiverRisk("1.3810");
                entity.setLiverLevel("一般");
            }else {
                entity.setLiverRisk("1.1880");
                entity.setLiverLevel("一般");
            }
        }
    }
    private void setLungRiskAndLevel(String p53Type, String apoeType, ReportEntity entity) {
        String sicks = entity.getSicks()+entity.getFamilySicks();
        if("正常".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.8134");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.6068");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("高血压")){
                entity.setLungRisk("1.6552");
                entity.setLungLevel("关注");
            }else if(sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.2680");
                entity.setLungLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setLungRisk("1.4970");
                entity.setLungLevel("一般");
            }else if(sicks.contains("高血压")){
                entity.setLungRisk("1.1582");
                entity.setLungLevel("一般");
            }else if(sicks.contains("肺结核")){
                entity.setLungRisk("1.1098");
                entity.setLungLevel("一般");
            }else {
                entity.setLungRisk("1.0000");
                entity.setLungLevel("正常");
            }
        }else if("纯合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.9760");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.8178");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("高血压")){
                entity.setLungRisk("1.8662");
                entity.setLungLevel("关注");
            }else if(sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.4790");
                entity.setLungLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setLungRisk("1.7080");
                entity.setLungLevel("关注");
            }else if(sicks.contains("高血压")){
                entity.setLungRisk("1.3692");
                entity.setLungLevel("一般");
            }else if(sicks.contains("肺结核")){
                entity.setLungRisk("1.3208");
                entity.setLungLevel("一般");
            }else {
                entity.setLungRisk("1.2110");
                entity.setLungLevel("一般");
            }
        }else if("杂合突变".equals(p53Type)){
            if(sicks.contains("吸烟")&&sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.8549");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.6967");
                entity.setLungLevel("关注");
            }else if(sicks.contains("吸烟")&&sicks.contains("高血压")){
                entity.setLungRisk("1.7451");
                entity.setLungLevel("关注");
            }else if(sicks.contains("高血压")&&sicks.contains("肺结核")){
                entity.setLungRisk("1.3579");
                entity.setLungLevel("一般");
            }else if(sicks.contains("吸烟")){
                entity.setLungRisk("1.5869");
                entity.setLungLevel("关注");
            }else if(sicks.contains("高血压")){
                entity.setLungRisk("1.2481");
                entity.setLungLevel("一般");
            }else if(sicks.contains("肺结核")){
                entity.setLungRisk("1.1997");
                entity.setLungLevel("一般");
            }else {
                entity.setLungRisk("1.0899");
                entity.setLungLevel("一般");
            }
        }else {
            return;
        }
    }
    private String getMTHFRType(String apoeRes) {
        if("A".equals(apoeRes)||"A/A".equals(apoeRes)){
            return "纯合突变";
        }else if("A/T".equals(apoeRes)||"T/A".equals(apoeRes)){
            return "纯合突变";
        }else if("A/C".equals(apoeRes)||"C/A".equals(apoeRes)){
            return "杂合突变";
        }else if("A/G".equals(apoeRes)||"G/A".equals(apoeRes)){
            return "纯合突变";
        }else if("T".equals(apoeRes)||"T/T".equals(apoeRes)){
            return "纯合突变";
        }else if("T/C".equals(apoeRes)||"C/T".equals(apoeRes)){
            return "杂合突变";
        }else if("T/G".equals(apoeRes)||"G/T".equals(apoeRes)){
            return "纯合突变";
        }else if("C".equals(apoeRes)||"C/C".equals(apoeRes)){
            return "正常";
        }else if("C/G".equals(apoeRes)||"G/C".equals(apoeRes)){
            return "杂合突变";
        }else if("G".equals(apoeRes)||"G/G".equals(apoeRes)){
            return "纯合突变";
        }
        return "";
    }

    private String getApoeType(String apoeRes) {
        if("A".equals(apoeRes)||"A/A".equals(apoeRes)){
            return "纯合突变";
        }else if("A/T".equals(apoeRes)||"T/A".equals(apoeRes)){
            return "纯合突变";
        }else if("A/C".equals(apoeRes)||"C/A".equals(apoeRes)){
            return "杂合突变";
        }else if("A/G".equals(apoeRes)||"G/A".equals(apoeRes)){
            return "纯合突变";
        }else if("T".equals(apoeRes)||"T/T".equals(apoeRes)){
            return "纯合突变";
        }else if("T/C".equals(apoeRes)||"C/T".equals(apoeRes)){
            return "杂合突变";
        }else if("T/G".equals(apoeRes)||"G/T".equals(apoeRes)){
            return "纯合突变";
        }else if("C".equals(apoeRes)||"C/C".equals(apoeRes)){
            return "正常";
        }else if("C/G".equals(apoeRes)||"G/C".equals(apoeRes)){
            return "杂合突变";
        }else if("G/G".equals(apoeRes)||"G".equals(apoeRes)){
            return "纯合突变";
        }
        return "";
    }

    private String getP53Type(String p53Res) {
        if("A".equals(p53Res)||"A/A".equals(p53Res)){
            return "正常";
        }else if("A/T".equals(p53Res)||"T/A".equals(p53Res)){
            return "杂合突变";
        }else if("A/C".equals(p53Res)||"C/A".equals(p53Res)){
            return "杂合突变";
        }else if("A/G".equals(p53Res)||"G/A".equals(p53Res)){
            return "杂合突变";
        }else if("T".equals(p53Res)||"T/T".equals(p53Res)){
            return "纯合突变";
        }else if("T/C".equals(p53Res)||"C/T".equals(p53Res)){
            return "纯合突变";
        }else if("T/G".equals(p53Res)||"G/T".equals(p53Res)){
            return "纯合突变";
        }else if("C".equals(p53Res)||"C/C".equals(p53Res)){
            return "纯合突变";
        }else if("C/G".equals(p53Res)||"G/C".equals(p53Res)){
            return "纯合突变";
        }else if("G".equals(p53Res)||"G/G".equals(p53Res)){
            return "纯合突变";
        }
        return "";
    }

    public static void main(String[] args) {
        // TODO 自动生成的方法存根
        new CreateReportAction();
    }
}  